susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MP13x.h
/*
  * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
*/

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define DCMIPP_D0_PA9_ PA9,GPIO_AF13
#define DCMIPP_D0_PD6_ PD6,GPIO_AF14
#define _DCMIPP_D0_PA9_ 1
#define _DCMIPP_D0_PD6_ 1

#define DCMIPP_D1_PA12_ PA12,GPIO_AF13
#define DCMIPP_D1_PD0_ PD0,GPIO_AF13
#define DCMIPP_D1_PE0_ PE0,GPIO_AF13
#define DCMIPP_D1_PG2_ PG2,GPIO_AF13
#define _DCMIPP_D1_PA12_ 1
#define _DCMIPP_D1_PD0_ 1
#define _DCMIPP_D1_PE0_ 1
#define _DCMIPP_D1_PG2_ 1

#define DCMIPP_D10_PE11_ PE11,GPIO_AF13
#define DCMIPP_D10_PE15_ PE15,GPIO_AF13
#define DCMIPP_D10_PG15_ PG15,GPIO_AF13
#define _DCMIPP_D10_PE11_ 1
#define _DCMIPP_D10_PE15_ 1
#define _DCMIPP_D10_PG15_ 1

#define DCMIPP_D11_PE12_ PE12,GPIO_AF13
#define DCMIPP_D11_PF5_ PF5,GPIO_AF13
#define _DCMIPP_D11_PE12_ 1
#define _DCMIPP_D11_PF5_ 1

#define DCMIPP_D12_PE0_ PE0,GPIO_AF6
#define DCMIPP_D12_PE1_ PE1,GPIO_AF14
#define DCMIPP_D12_PG3_ PG3,GPIO_AF14
#define _DCMIPP_D12_PE0_ 1
#define _DCMIPP_D12_PE1_ 1
#define _DCMIPP_D12_PG3_ 1

#define DCMIPP_D13_PB7_ PB7,GPIO_AF13
#define DCMIPP_D13_PD1_ PD1,GPIO_AF13
#define DCMIPP_D13_PG4_ PG4,GPIO_AF14
#define DCMIPP_D13_PH9_ PH9,GPIO_AF6
#define _DCMIPP_D13_PB7_ 1
#define _DCMIPP_D13_PD1_ 1
#define _DCMIPP_D13_PG4_ 1
#define _DCMIPP_D13_PH9_ 1

#define DCMIPP_D14_PA15_ PA15,GPIO_AF13
#define DCMIPP_D14_PG11_ PG11,GPIO_AF13
#define _DCMIPP_D14_PA15_ 1
#define _DCMIPP_D14_PG11_ 1

#define DCMIPP_D15_PF8_ PF8,GPIO_AF13
#define DCMIPP_D15_PG3_ PG3,GPIO_AF13
#define _DCMIPP_D15_PF8_ 1
#define _DCMIPP_D15_PG3_ 1

#define DCMIPP_D2_PG10_ PG10,GPIO_AF13
#define DCMIPP_D2_PH14_ PH14,GPIO_AF13
#define _DCMIPP_D2_PG10_ 1
#define _DCMIPP_D2_PH14_ 1

#define DCMIPP_D3_PD8_ PD8,GPIO_AF14
#define DCMIPP_D3_PE1_ PE1,GPIO_AF13
#define DCMIPP_D3_PE4_ PE4,GPIO_AF13
#define DCMIPP_D3_PG5_ PG5,GPIO_AF14
#define DCMIPP_D3_PH12_ PH12,GPIO_AF13
#define _DCMIPP_D3_PD8_ 1
#define _DCMIPP_D3_PE1_ 1
#define _DCMIPP_D3_PE4_ 1
#define _DCMIPP_D3_PG5_ 1
#define _DCMIPP_D3_PH12_ 1

#define DCMIPP_D4_PD11_ PD11,GPIO_AF14
#define DCMIPP_D4_PD6_ PD6,GPIO_AF13
#define DCMIPP_D4_PE13_ PE13,GPIO_AF13
#define DCMIPP_D4_PF4_ PF4,GPIO_AF13
#define _DCMIPP_D4_PD11_ 1
#define _DCMIPP_D4_PD6_ 1
#define _DCMIPP_D4_PE13_ 1
#define _DCMIPP_D4_PF4_ 1

#define DCMIPP_D5_PA15_ PA15,GPIO_AF14
#define DCMIPP_D5_PB6_ PB6,GPIO_AF13
#define DCMIPP_D5_PD3_ PD3,GPIO_AF13
#define _DCMIPP_D5_PA15_ 1
#define _DCMIPP_D5_PB6_ 1
#define _DCMIPP_D5_PD3_ 1

#define DCMIPP_D6_PB8_ PB8,GPIO_AF13
#define DCMIPP_D6_PD12_ PD12,GPIO_AF13
#define DCMIPP_D6_PG8_ PG8,GPIO_AF14
#define _DCMIPP_D6_PB8_ 1
#define _DCMIPP_D6_PD12_ 1
#define _DCMIPP_D6_PG8_ 1

#define DCMIPP_D7_PE14_ PE14,GPIO_AF13
#define DCMIPP_D7_PE6_ PE6,GPIO_AF13
#define DCMIPP_D7_PE9_ PE9,GPIO_AF13
#define _DCMIPP_D7_PE14_ 1
#define _DCMIPP_D7_PE6_ 1
#define _DCMIPP_D7_PE9_ 1

#define DCMIPP_D8_PD14_ PD14,GPIO_AF13
#define DCMIPP_D8_PG4_ PG4,GPIO_AF13
#define DCMIPP_D8_PH14_ PH14,GPIO_AF6
#define DCMIPP_D8_PH9_ PH9,GPIO_AF14
#define _DCMIPP_D8_PD14_ 1
#define _DCMIPP_D8_PG4_ 1
#define _DCMIPP_D8_PH14_ 1
#define _DCMIPP_D8_PH9_ 1

#define DCMIPP_D9_PD8_ PD8,GPIO_AF13
#define DCMIPP_D9_PH2_ PH2,GPIO_AF6
#define DCMIPP_D9_PH9_ PH9,GPIO_AF13
#define _DCMIPP_D9_PD8_ 1
#define _DCMIPP_D9_PH2_ 1
#define _DCMIPP_D9_PH9_ 1

#define DCMIPP_HSYNC_PF10_ PF10,GPIO_AF13
#define DCMIPP_HSYNC_PH8_ PH8,GPIO_AF13
#define _DCMIPP_HSYNC_PF10_ 1
#define _DCMIPP_HSYNC_PH8_ 1

#define DCMIPP_PIXCLK_PB7_ PB7,GPIO_AF14
#define DCMIPP_PIXCLK_PG0_ PG0,GPIO_AF13
#define DCMIPP_PIXCLK_PH14_ PH14,GPIO_AF14
#define _DCMIPP_PIXCLK_PB7_ 1
#define _DCMIPP_PIXCLK_PG0_ 1
#define _DCMIPP_PIXCLK_PH14_ 1

#define DCMIPP_VSYNC_PD10_ PD10,GPIO_AF13
#define DCMIPP_VSYNC_PG5_ PG5,GPIO_AF13
#define DCMIPP_VSYNC_PG9_ PG9,GPIO_AF13
#define _DCMIPP_VSYNC_PD10_ 1
#define _DCMIPP_VSYNC_PG5_ 1
#define _DCMIPP_VSYNC_PG9_ 1

#define DEBUG_DBTRGI_PA13_ PA13,GPIO_AF1
#define DEBUG_DBTRGI_PA14_ PA14,GPIO_AF1
#define DEBUG_DBTRGI_PB0_ PB0,GPIO_AF0
#define _DEBUG_DBTRGI_PA13_ 1
#define _DEBUG_DBTRGI_PA14_ 1
#define _DEBUG_DBTRGI_PB0_ 1

#define DEBUG_DBTRGO_PA13_ PA13,GPIO_AF0
#define DEBUG_DBTRGO_PA14_ PA14,GPIO_AF0
#define DEBUG_DBTRGO_PG9_ PG9,GPIO_AF0
#define _DEBUG_DBTRGO_PA13_ 1
#define _DEBUG_DBTRGO_PA14_ 1
#define _DEBUG_DBTRGO_PG9_ 1

#define DEBUG_TRACECLK_PB13_ PB13,GPIO_AF0
#define DEBUG_TRACECLK_PC12_ PC12,GPIO_AF0
#define DEBUG_TRACECLK_PD9_ PD9,GPIO_AF0
#define DEBUG_TRACECLK_PE2_ PE2,GPIO_AF0
#define _DEBUG_TRACECLK_PB13_ 1
#define _DEBUG_TRACECLK_PC12_ 1
#define _DEBUG_TRACECLK_PD9_ 1
#define _DEBUG_TRACECLK_PE2_ 1

#define DEBUG_TRACED0_PB14_ PB14,GPIO_AF0
#define DEBUG_TRACED0_PC8_ PC8,GPIO_AF0
#define DEBUG_TRACED0_PH10_ PH10,GPIO_AF0
#define _DEBUG_TRACED0_PB14_ 1
#define _DEBUG_TRACED0_PC8_ 1
#define _DEBUG_TRACED0_PH10_ 1

#define DEBUG_TRACED1_PC9_ PC9,GPIO_AF0
#define DEBUG_TRACED1_PF2_ PF2,GPIO_AF0
#define DEBUG_TRACED1_PG4_ PG4,GPIO_AF0
#define _DEBUG_TRACED1_PC9_ 1
#define _DEBUG_TRACED1_PF2_ 1
#define _DEBUG_TRACED1_PG4_ 1

#define DEBUG_TRACED10_PB12_ PB12,GPIO_AF0
#define _DEBUG_TRACED10_PB12_ 1

#define DEBUG_TRACED11_PE3_ PE3,GPIO_AF0
#define _DEBUG_TRACED11_PE3_ 1

#define DEBUG_TRACED12_PF5_ PF5,GPIO_AF0
#define _DEBUG_TRACED12_PF5_ 1

#define DEBUG_TRACED13_PF0_ PF0,GPIO_AF0
#define _DEBUG_TRACED13_PF0_ 1

#define DEBUG_TRACED14_PB4_ PB4,GPIO_AF0
#define _DEBUG_TRACED14_PB4_ 1

#define DEBUG_TRACED15_PH13_ PH13,GPIO_AF0
#define _DEBUG_TRACED15_PH13_ 1

#define DEBUG_TRACED2_PB3_ PB3,GPIO_AF0
#define DEBUG_TRACED2_PC10_ PC10,GPIO_AF0
#define DEBUG_TRACED2_PC6_ PC6,GPIO_AF0
#define _DEBUG_TRACED2_PB3_ 1
#define _DEBUG_TRACED2_PC10_ 1
#define _DEBUG_TRACED2_PC6_ 1

#define DEBUG_TRACED3_PB9_ PB9,GPIO_AF0
#define DEBUG_TRACED3_PC11_ PC11,GPIO_AF0
#define DEBUG_TRACED3_PG6_ PG6,GPIO_AF0
#define _DEBUG_TRACED3_PB9_ 1
#define _DEBUG_TRACED3_PC11_ 1
#define _DEBUG_TRACED3_PG6_ 1

#define DEBUG_TRACED4_PB5_ PB5,GPIO_AF0
#define DEBUG_TRACED4_PC7_ PC7,GPIO_AF0
#define DEBUG_TRACED4_PD2_ PD2,GPIO_AF0
#define _DEBUG_TRACED4_PB5_ 1
#define _DEBUG_TRACED4_PC7_ 1
#define _DEBUG_TRACED4_PD2_ 1

#define DEBUG_TRACED5_PA15_ PA15,GPIO_AF0
#define _DEBUG_TRACED5_PA15_ 1

#define DEBUG_TRACED6_PB6_ PB6,GPIO_AF0
#define _DEBUG_TRACED6_PB6_ 1

