susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MP13x.h
#define DEBUG_TRACED7_PF1_ PF1,GPIO_AF0
#define _DEBUG_TRACED7_PF1_ 1

#define DEBUG_TRACED8_PG7_ PG7,GPIO_AF0
#define _DEBUG_TRACED8_PG7_ 1

#define DEBUG_TRACED9_PH8_ PH8,GPIO_AF0
#define _DEBUG_TRACED9_PH8_ 1

#define DFSDM1_CKIN0_PA1_ PA1,GPIO_AF6
#define DFSDM1_CKIN0_PD4_ PD4,GPIO_AF6
#define DFSDM1_CKIN0_PF5_ PF5,GPIO_AF4
#define _DFSDM1_CKIN0_PA1_ 1
#define _DFSDM1_CKIN0_PD4_ 1
#define _DFSDM1_CKIN0_PF5_ 1

#define DFSDM1_CKIN1_PA4_ PA4,GPIO_AF6
#define DFSDM1_CKIN1_PF2_ PF2,GPIO_AF6
#define DFSDM1_CKIN1_PH12_ PH12,GPIO_AF3
#define _DFSDM1_CKIN1_PA4_ 1
#define _DFSDM1_CKIN1_PF2_ 1
#define _DFSDM1_CKIN1_PH12_ 1

#define DFSDM1_CKIN2_PB15_ PB15,GPIO_AF6
#define DFSDM1_CKIN2_PC4_ PC4,GPIO_AF3
#define DFSDM1_CKIN2_PE8_ PE8,GPIO_AF3
#define _DFSDM1_CKIN2_PB15_ 1
#define _DFSDM1_CKIN2_PC4_ 1
#define _DFSDM1_CKIN2_PE8_ 1

#define DFSDM1_CKIN3_PF11_ PF11,GPIO_AF3
#define DFSDM1_CKIN3_PF9_ PF9,GPIO_AF3
#define DFSDM1_CKIN3_PG4_ PG4,GPIO_AF4
#define _DFSDM1_CKIN3_PF11_ 1
#define _DFSDM1_CKIN3_PF9_ 1
#define _DFSDM1_CKIN3_PG4_ 1

#define DFSDM1_CKOUT_PC3_ PC3,GPIO_AF3
#define DFSDM1_CKOUT_PD3_ PD3,GPIO_AF4
#define DFSDM1_CKOUT_PF0_ PF0,GPIO_AF3
#define _DFSDM1_CKOUT_PC3_ 1
#define _DFSDM1_CKOUT_PD3_ 1
#define _DFSDM1_CKOUT_PF0_ 1

#define DFSDM1_DATIN0_PA9_ PA9,GPIO_AF6
#define DFSDM1_DATIN0_PC1_ PC1,GPIO_AF3
#define DFSDM1_DATIN0_PC6_ PC6,GPIO_AF4
#define _DFSDM1_DATIN0_PA9_ 1
#define _DFSDM1_DATIN0_PC1_ 1
#define _DFSDM1_DATIN0_PC6_ 1

#define DFSDM1_DATIN1_PB1_ PB1,GPIO_AF6
#define DFSDM1_DATIN1_PB12_ PB12,GPIO_AF6
#define DFSDM1_DATIN1_PB8_ PB8,GPIO_AF6
#define _DFSDM1_DATIN1_PB1_ 1
#define _DFSDM1_DATIN1_PB12_ 1
#define _DFSDM1_DATIN1_PB8_ 1

#define DFSDM1_DATIN2_PC5_ PC5,GPIO_AF3
#define DFSDM1_DATIN2_PD15_ PD15,GPIO_AF3
#define DFSDM1_DATIN2_PH10_ PH10,GPIO_AF4
#define DFSDM1_DATIN2_PH14_ PH14,GPIO_AF3
#define _DFSDM1_DATIN2_PC5_ 1
#define _DFSDM1_DATIN2_PD15_ 1
#define _DFSDM1_DATIN2_PH10_ 1
#define _DFSDM1_DATIN2_PH14_ 1

#define DFSDM1_DATIN3_PD9_ PD9,GPIO_AF3
#define DFSDM1_DATIN3_PE4_ PE4,GPIO_AF3
#define DFSDM1_DATIN3_PF13_ PF13,GPIO_AF6
#define _DFSDM1_DATIN3_PD9_ 1
#define _DFSDM1_DATIN3_PE4_ 1
#define _DFSDM1_DATIN3_PF13_ 1

#define ETH1_CLK_PA11_ PA11,GPIO_AF11
#define _ETH1_CLK_PA11_ 1

#define ETH1_CLK125_PF12_ PF12,GPIO_AF11
#define ETH1_CLK125_PF7_ PF7,GPIO_AF10
#define _ETH1_CLK125_PF12_ 1
#define _ETH1_CLK125_PF7_ 1

#define ETH1_COL_PA3_ PA3,GPIO_AF11
#define ETH1_COL_PH3_ PH3,GPIO_AF10
#define _ETH1_COL_PA3_ 1
#define _ETH1_COL_PH3_ 1

#define ETH1_CRS_PA0_ PA0,GPIO_AF11
#define ETH1_CRS_PH12_ PH12,GPIO_AF11
#define ETH1_CRS_PH2_ PH2,GPIO_AF11
#define _ETH1_CRS_PA0_ 1
#define _ETH1_CRS_PH12_ 1
#define _ETH1_CRS_PH2_ 1

#define ETH1_CRS_DV_PA7_ PA7,GPIO_AF11
#define ETH1_CRS_DV_PC1_ PC1,GPIO_AF10
#define _ETH1_CRS_DV_PA7_ 1
#define _ETH1_CRS_DV_PC1_ 1

#define ETH1_GTX_CLK_PC1_ PC1,GPIO_AF11
#define _ETH1_GTX_CLK_PC1_ 1

#define ETH1_MDC_PG2_ PG2,GPIO_AF11
#define _ETH1_MDC_PG2_ 1

#define ETH1_MDIO_PA2_ PA2,GPIO_AF11
#define ETH1_MDIO_PG3_ PG3,GPIO_AF11
#define _ETH1_MDIO_PA2_ 1
#define _ETH1_MDIO_PG3_ 1

#define ETH1_PHY_INTN_PG12_ PG12,GPIO_AF11
#define ETH1_PHY_INTN_PH6_ PH6,GPIO_AF10
#define _ETH1_PHY_INTN_PG12_ 1
#define _ETH1_PHY_INTN_PH6_ 1

#define ETH1_PPS_OUT_PA4_ PA4,GPIO_AF10
#define ETH1_PPS_OUT_PA5_ PA5,GPIO_AF10
#define _ETH1_PPS_OUT_PA4_ 1
#define _ETH1_PPS_OUT_PA5_ 1

#define ETH1_REF_CLK_PA1_ PA1,GPIO_AF11
#define ETH1_REF_CLK_PD7_ PD7,GPIO_AF10
#define _ETH1_REF_CLK_PA1_ 1
#define _ETH1_REF_CLK_PD7_ 1

#define ETH1_RXD0_PC4_ PC4,GPIO_AF11
#define _ETH1_RXD0_PC4_ 1

#define ETH1_RXD1_PC5_ PC5,GPIO_AF11
#define _ETH1_RXD1_PC5_ 1

#define ETH1_RXD2_PB0_ PB0,GPIO_AF11
#define _ETH1_RXD2_PB0_ 1

#define ETH1_RXD3_PB1_ PB1,GPIO_AF11
#define _ETH1_RXD3_PB1_ 1

#define ETH1_RX_CLK_PA1_ PA1,GPIO_AF11
#define ETH1_RX_CLK_PD7_ PD7,GPIO_AF10
#define _ETH1_RX_CLK_PA1_ 1
#define _ETH1_RX_CLK_PD7_ 1

#define ETH1_RX_CTL_PA7_ PA7,GPIO_AF11
#define _ETH1_RX_CTL_PA7_ 1

#define ETH1_RX_DV_PA7_ PA7,GPIO_AF11
#define ETH1_RX_DV_PC1_ PC1,GPIO_AF10
#define _ETH1_RX_DV_PA7_ 1
#define _ETH1_RX_DV_PC1_ 1

#define ETH1_RX_ER_PH6_ PH6,GPIO_AF11
#define ETH1_RX_ER_PI3_ PI3,GPIO_AF11
#define _ETH1_RX_ER_PH6_ 1
#define _ETH1_RX_ER_PI3_ 1

#define ETH1_TXD0_PG13_ PG13,GPIO_AF11
#define _ETH1_TXD0_PG13_ 1

#define ETH1_TXD1_PG14_ PG14,GPIO_AF11
#define _ETH1_TXD1_PG14_ 1

#define ETH1_TXD2_PC2_ PC2,GPIO_AF11
#define _ETH1_TXD2_PC2_ 1

#define ETH1_TXD3_PE5_ PE5,GPIO_AF10
#define _ETH1_TXD3_PE5_ 1

#define ETH1_TX_CLK_PC3_ PC3,GPIO_AF11
#define ETH1_TX_CLK_PH7_ PH7,GPIO_AF11
#define _ETH1_TX_CLK_PC3_ 1
#define _ETH1_TX_CLK_PH7_ 1

#define ETH1_TX_CTL_PB11_ PB11,GPIO_AF11
#define _ETH1_TX_CTL_PB11_ 1

#define ETH1_TX_EN_PB11_ PB11,GPIO_AF11
#define _ETH1_TX_EN_PB11_ 1

#define ETH1_TX_ER_PE11_ PE11,GPIO_AF11
#define ETH1_TX_ER_PF12_ PF12,GPIO_AF10
#define _ETH1_TX_ER_PE11_ 1
#define _ETH1_TX_ER_PF12_ 1

#define ETH2_CLK_PA11_ PA11,GPIO_AF13
#define ETH2_CLK_PG8_ PG8,GPIO_AF13
#define _ETH2_CLK_PA11_ 1
#define _ETH2_CLK_PG8_ 1

#define ETH2_CLK125_PD11_ PD11,GPIO_AF10
#define ETH2_CLK125_PH2_ PH2,GPIO_AF13
#define _ETH2_CLK125_PD11_ 1
#define _ETH2_CLK125_PH2_ 1

#define ETH2_COL_PA3_ PA3,GPIO_AF12
#define ETH2_COL_PH3_ PH3,GPIO_AF12
#define _ETH2_COL_PA3_ 1
#define _ETH2_COL_PH3_ 1

#define ETH2_CRS_PA0_ PA0,GPIO_AF12
#define ETH2_CRS_PH2_ PH2,GPIO_AF10
#define _ETH2_CRS_PA0_ 1
#define _ETH2_CRS_PH2_ 1

#define ETH2_CRS_DV_PA12_ PA12,GPIO_AF11
#define ETH2_CRS_DV_PG12_ PG12,GPIO_AF12
#define _ETH2_CRS_DV_PA12_ 1
#define _ETH2_CRS_DV_PG12_ 1

#define ETH2_GTX_CLK_PG3_ PG3,GPIO_AF10
#define _ETH2_GTX_CLK_PG3_ 1

#define ETH2_MDC_PG5_ PG5,GPIO_AF10
#define _ETH2_MDC_PG5_ 1

#define ETH2_MDIO_PB2_ PB2,GPIO_AF11
#define ETH2_MDIO_PB6_ PB6,GPIO_AF11
#define _ETH2_MDIO_PB2_ 1
#define _ETH2_MDIO_PB6_ 1

#define ETH2_PHY_INTN_PG12_ PG12,GPIO_AF10
#define ETH2_PHY_INTN_PG15_ PG15,GPIO_AF10
#define _ETH2_PHY_INTN_PG12_ 1
#define _ETH2_PHY_INTN_PG15_ 1

#define ETH2_PPS_OUT_PA4_ PA4,GPIO_AF11
#define ETH2_PPS_OUT_PA5_ PA5,GPIO_AF11
#define _ETH2_PPS_OUT_PA4_ 1
#define _ETH2_PPS_OUT_PA5_ 1

#define ETH2_REF_CLK_PH11_ PH11,GPIO_AF11
#define _ETH2_REF_CLK_PH11_ 1

#define ETH2_RXD0_PF4_ PF4,GPIO_AF11
#define _ETH2_RXD0_PF4_ 1

#define ETH2_RXD1_PA11_ PA11,GPIO_AF10
#define ETH2_RXD1_PE2_ PE2,GPIO_AF10
#define _ETH2_RXD1_PA11_ 1
#define _ETH2_RXD1_PE2_ 1

#define ETH2_RXD2_PH6_ PH6,GPIO_AF12
#define _ETH2_RXD2_PH6_ 1

#define ETH2_RXD3_PA8_ PA8,GPIO_AF11
#define _ETH2_RXD3_PA8_ 1

#define ETH2_RX_CLK_PH11_ PH11,GPIO_AF11
#define _ETH2_RX_CLK_PH11_ 1

#define ETH2_RX_CTL_PA12_ PA12,GPIO_AF11
#define ETH2_RX_CTL_PG12_ PG12,GPIO_AF12
#define _ETH2_RX_CTL_PA12_ 1
#define _ETH2_RX_CTL_PG12_ 1

#define ETH2_RX_DV_PA12_ PA12,GPIO_AF11
#define ETH2_RX_DV_PG12_ PG12,GPIO_AF12
#define _ETH2_RX_DV_PA12_ 1
#define _ETH2_RX_DV_PG12_ 1

#define ETH2_RX_ER_PF11_ PF11,GPIO_AF12
#define _ETH2_RX_ER_PF11_ 1

#define ETH2_TXD0_PF7_ PF7,GPIO_AF11
#define _ETH2_TXD0_PF7_ 1

#define ETH2_TXD1_PG11_ PG11,GPIO_AF10
#define _ETH2_TXD1_PG11_ 1

#define ETH2_TXD2_PG1_ PG1,GPIO_AF10
#define _ETH2_TXD2_PG1_ 1

