susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MP13x.h
#define ETH2_TXD3_PE6_ PE6,GPIO_AF11
#define _ETH2_TXD3_PE6_ 1

#define ETH2_TX_CLK_PC3_ PC3,GPIO_AF12
#define ETH2_TX_CLK_PH7_ PH7,GPIO_AF10
#define _ETH2_TX_CLK_PC3_ 1
#define _ETH2_TX_CLK_PH7_ 1

#define ETH2_TX_CTL_PF6_ PF6,GPIO_AF11
#define _ETH2_TX_CTL_PF6_ 1

#define ETH2_TX_EN_PF6_ PF6,GPIO_AF11
#define _ETH2_TX_EN_PF6_ 1

#define ETH2_TX_ER_PE11_ PE11,GPIO_AF10
#define _ETH2_TX_ER_PE11_ 1

#define FDCAN1_RX_PD0_ PD0,GPIO_AF9
#define FDCAN1_RX_PE3_ PE3,GPIO_AF9
#define FDCAN1_RX_PG9_ PG9,GPIO_AF9
#define _FDCAN1_RX_PD0_ 1
#define _FDCAN1_RX_PE3_ 1
#define _FDCAN1_RX_PG9_ 1

#define FDCAN1_TX_PB9_ PB9,GPIO_AF9
#define FDCAN1_TX_PC9_ PC9,GPIO_AF9
#define FDCAN1_TX_PE10_ PE10,GPIO_AF9
#define FDCAN1_TX_PG10_ PG10,GPIO_AF9
#define _FDCAN1_TX_PB9_ 1
#define _FDCAN1_TX_PC9_ 1
#define _FDCAN1_TX_PE10_ 1
#define _FDCAN1_TX_PG10_ 1

#define FDCAN2_RX_PB5_ PB5,GPIO_AF9
#define FDCAN2_RX_PE0_ PE0,GPIO_AF9
#define FDCAN2_RX_PG3_ PG3,GPIO_AF9
#define _FDCAN2_RX_PB5_ 1
#define _FDCAN2_RX_PE0_ 1
#define _FDCAN2_RX_PG3_ 1

#define FDCAN2_TX_PB13_ PB13,GPIO_AF9
#define FDCAN2_TX_PG0_ PG0,GPIO_AF9
#define FDCAN2_TX_PG1_ PG1,GPIO_AF9
#define _FDCAN2_TX_PB13_ 1
#define _FDCAN2_TX_PG0_ 1
#define _FDCAN2_TX_PG1_ 1

#define FMC_A0_PF0_ PF0,GPIO_AF12
#define _FMC_A0_PF0_ 1

#define FMC_A1_PF1_ PF1,GPIO_AF12
#define _FMC_A1_PF1_ 1

#define FMC_A10_PG0_ PG0,GPIO_AF12
#define _FMC_A10_PG0_ 1

#define FMC_A11_PE0_ PE0,GPIO_AF12
#define _FMC_A11_PE0_ 1

#define FMC_A12_PH11_ PH11,GPIO_AF12
#define _FMC_A12_PH11_ 1

#define FMC_A13_PG3_ PG3,GPIO_AF12
#define _FMC_A13_PG3_ 1

#define FMC_A14_PG4_ PG4,GPIO_AF12
#define _FMC_A14_PG4_ 1

#define FMC_A15_PG5_ PG5,GPIO_AF12
#define _FMC_A15_PG5_ 1

#define FMC_A16_PD11_ PD11,GPIO_AF12
#define _FMC_A16_PD11_ 1

#define FMC_A17_PD12_ PD12,GPIO_AF12
#define _FMC_A17_PD12_ 1

#define FMC_A18_PD13_ PD13,GPIO_AF12
#define FMC_A18_PF7_ PF7,GPIO_AF12
#define _FMC_A18_PD13_ 1
#define _FMC_A18_PF7_ 1

#define FMC_A19_PC6_ PC6,GPIO_AF12
#define _FMC_A19_PC6_ 1

#define FMC_A2_PF2_ PF2,GPIO_AF12
#define _FMC_A2_PF2_ 1

#define FMC_A20_PH9_ PH9,GPIO_AF12
#define _FMC_A20_PH9_ 1

#define FMC_A21_PA8_ PA8,GPIO_AF12
#define _FMC_A21_PA8_ 1

#define FMC_A22_PE6_ PE6,GPIO_AF12
#define _FMC_A22_PE6_ 1

#define FMC_A23_PE2_ PE2,GPIO_AF12
#define _FMC_A23_PE2_ 1

#define FMC_A24_PG11_ PG11,GPIO_AF12
#define _FMC_A24_PG11_ 1

#define FMC_A25_PE4_ PE4,GPIO_AF12
#define _FMC_A25_PE4_ 1

#define FMC_A3_PF3_ PF3,GPIO_AF12
#define _FMC_A3_PF3_ 1

#define FMC_A4_PF4_ PF4,GPIO_AF12
#define _FMC_A4_PF4_ 1

#define FMC_A5_PF5_ PF5,GPIO_AF12
#define _FMC_A5_PF5_ 1

#define FMC_A6_PB2_ PB2,GPIO_AF12
#define FMC_A6_PH12_ PH12,GPIO_AF12
#define _FMC_A6_PB2_ 1
#define _FMC_A6_PH12_ 1

#define FMC_A7_PA12_ PA12,GPIO_AF12
#define _FMC_A7_PA12_ 1

#define FMC_A8_PH8_ PH8,GPIO_AF12
#define _FMC_A8_PH8_ 1

#define FMC_A9_PA15_ PA15,GPIO_AF12
#define FMC_A9_PF9_ PF9,GPIO_AF12
#define _FMC_A9_PA15_ 1
#define _FMC_A9_PF9_ 1

#define FMC_ALE_PD12_ PD12,GPIO_AF12
#define _FMC_ALE_PD12_ 1

#define FMC_CLE_PD11_ PD11,GPIO_AF12
#define _FMC_CLE_PD11_ 1

#define FMC_CLK_PD3_ PD3,GPIO_AF12
#define _FMC_CLK_PD3_ 1

#define FMC_D0_PD14_ PD14,GPIO_AF12
#define _FMC_D0_PD14_ 1

#define FMC_D1_PD15_ PD15,GPIO_AF12
#define _FMC_D1_PD15_ 1

#define FMC_D10_PE13_ PE13,GPIO_AF12
#define _FMC_D10_PE13_ 1

#define FMC_D11_PE14_ PE14,GPIO_AF12
#define _FMC_D11_PE14_ 1

#define FMC_D12_PE15_ PE15,GPIO_AF12
#define _FMC_D12_PE15_ 1

#define FMC_D13_PB8_ PB8,GPIO_AF12
#define _FMC_D13_PB8_ 1

#define FMC_D14_PD9_ PD9,GPIO_AF12
#define _FMC_D14_PD9_ 1

#define FMC_D15_PD10_ PD10,GPIO_AF12
#define _FMC_D15_PD10_ 1

#define FMC_D2_PD0_ PD0,GPIO_AF12
#define _FMC_D2_PD0_ 1

#define FMC_D3_PD1_ PD1,GPIO_AF12
#define _FMC_D3_PD1_ 1

#define FMC_D4_PE7_ PE7,GPIO_AF12
#define _FMC_D4_PE7_ 1

#define FMC_D5_PE8_ PE8,GPIO_AF12
#define _FMC_D5_PE8_ 1

#define FMC_D6_PE9_ PE9,GPIO_AF12
#define _FMC_D6_PE9_ 1

#define FMC_D7_PE10_ PE10,GPIO_AF12
#define _FMC_D7_PE10_ 1

#define FMC_D8_PE11_ PE11,GPIO_AF12
#define _FMC_D8_PE11_ 1

#define FMC_D9_PE12_ PE12,GPIO_AF12
#define _FMC_D9_PE12_ 1

#define FMC_DA0_PD14_ PD14,GPIO_AF12
#define _FMC_DA0_PD14_ 1

#define FMC_DA1_PD15_ PD15,GPIO_AF12
#define _FMC_DA1_PD15_ 1

#define FMC_DA10_PE13_ PE13,GPIO_AF12
#define _FMC_DA10_PE13_ 1

#define FMC_DA11_PE14_ PE14,GPIO_AF12
#define _FMC_DA11_PE14_ 1

#define FMC_DA12_PE15_ PE15,GPIO_AF12
#define _FMC_DA12_PE15_ 1

#define FMC_DA13_PB8_ PB8,GPIO_AF12
#define _FMC_DA13_PB8_ 1

#define FMC_DA14_PD9_ PD9,GPIO_AF12
#define _FMC_DA14_PD9_ 1

#define FMC_DA15_PD10_ PD10,GPIO_AF12
#define _FMC_DA15_PD10_ 1

#define FMC_DA2_PD0_ PD0,GPIO_AF12
#define _FMC_DA2_PD0_ 1

#define FMC_DA3_PD1_ PD1,GPIO_AF12
#define _FMC_DA3_PD1_ 1

#define FMC_DA4_PE7_ PE7,GPIO_AF12
#define _FMC_DA4_PE7_ 1

#define FMC_DA5_PE8_ PE8,GPIO_AF12
#define _FMC_DA5_PE8_ 1

#define FMC_DA6_PE9_ PE9,GPIO_AF12
#define _FMC_DA6_PE9_ 1

#define FMC_DA7_PE10_ PE10,GPIO_AF12
#define _FMC_DA7_PE10_ 1

#define FMC_DA8_PE11_ PE11,GPIO_AF12
#define _FMC_DA8_PE11_ 1

#define FMC_DA9_PE12_ PE12,GPIO_AF12
#define _FMC_DA9_PE12_ 1

#define FMC_NBL0_PG1_ PG1,GPIO_AF12
#define _FMC_NBL0_PG1_ 1

#define FMC_NBL1_PE1_ PE1,GPIO_AF12
#define _FMC_NBL1_PE1_ 1

#define FMC_NCE_PG9_ PG9,GPIO_AF12
#define _FMC_NCE_PG9_ 1

#define FMC_NCE2_PB7_ PB7,GPIO_AF10
#define FMC_NCE2_PE4_ PE4,GPIO_AF10
#define _FMC_NCE2_PB7_ 1
#define _FMC_NCE2_PE4_ 1

#define FMC_NE1_PD7_ PD7,GPIO_AF12
#define FMC_NE1_PE5_ PE5,GPIO_AF12
#define _FMC_NE1_PD7_ 1
#define _FMC_NE1_PE5_ 1

#define FMC_NE2_PG8_ PG8,GPIO_AF12
#define FMC_NE2_PG9_ PG9,GPIO_AF10
#define _FMC_NE2_PG8_ 1
#define _FMC_NE2_PG9_ 1

#define FMC_NE3_PB6_ PB6,GPIO_AF12
#define FMC_NE3_PG10_ PG10,GPIO_AF12
#define _FMC_NE3_PB6_ 1
#define _FMC_NE3_PG10_ 1

#define FMC_NE4_PH2_ PH2,GPIO_AF12
#define _FMC_NE4_PH2_ 1

#define FMC_NL_PB7_ PB7,GPIO_AF12
#define _FMC_NL_PB7_ 1

#define FMC_NOE_PD4_ PD4,GPIO_AF12
#define _FMC_NOE_PD4_ 1

#define FMC_NWAIT_PA9_ PA9,GPIO_AF10
#define _FMC_NWAIT_PA9_ 1

#define FMC_NWE_PD5_ PD5,GPIO_AF12
#define _FMC_NWE_PD5_ 1

#define HDP_HDP0_PH10_ PH10,GPIO_AF15
#define _HDP_HDP0_PH10_ 1

