susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MP13x.h
#define HDP_HDP1_PG4_ PG4,GPIO_AF15
#define _HDP_HDP1_PG4_ 1

#define HDP_HDP2_PC6_ PC6,GPIO_AF15
#define HDP_HDP2_PH8_ PH8,GPIO_AF15
#define _HDP_HDP2_PC6_ 1
#define _HDP_HDP2_PH8_ 1

#define HDP_HDP3_PE9_ PE9,GPIO_AF15
#define HDP_HDP3_PG6_ PG6,GPIO_AF15
#define _HDP_HDP3_PE9_ 1
#define _HDP_HDP3_PG6_ 1

#define HDP_HDP4_PC7_ PC7,GPIO_AF15
#define HDP_HDP4_PE12_ PE12,GPIO_AF15
#define _HDP_HDP4_PC7_ 1
#define _HDP_HDP4_PE12_ 1

#define HDP_HDP5_PA15_ PA15,GPIO_AF15
#define _HDP_HDP5_PA15_ 1

#define HDP_HDP6_PB6_ PB6,GPIO_AF15
#define _HDP_HDP6_PB6_ 1

#define HDP_HDP7_PE15_ PE15,GPIO_AF15
#define HDP_HDP7_PF1_ PF1,GPIO_AF15
#define _HDP_HDP7_PE15_ 1
#define _HDP_HDP7_PF1_ 1

#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define I2C1_SCL_PC10_ PC10,GPIO_AF5
#define I2C1_SCL_PD12_ PD12,GPIO_AF5
#define _I2C1_SCL_PB8_ 1
#define _I2C1_SCL_PC10_ 1
#define _I2C1_SCL_PD12_ 1

#define I2C1_SDA_PC11_ PC11,GPIO_AF4
#define I2C1_SDA_PD3_ PD3,GPIO_AF5
#define I2C1_SDA_PE8_ PE8,GPIO_AF5
#define _I2C1_SDA_PC11_ 1
#define _I2C1_SDA_PD3_ 1
#define _I2C1_SDA_PE8_ 1

#define I2C1_SMBA_PD2_ PD2,GPIO_AF4
#define I2C1_SMBA_PF5_ PF5,GPIO_AF5
#define _I2C1_SMBA_PD2_ 1
#define _I2C1_SMBA_PF5_ 1

#define I2C2_SCL_PD7_ PD7,GPIO_AF4
#define I2C2_SCL_PF2_ PF2,GPIO_AF4
#define _I2C2_SCL_PD7_ 1
#define _I2C2_SCL_PF2_ 1

#define I2C2_SDA_PF1_ PF1,GPIO_AF4
#define I2C2_SDA_PG3_ PG3,GPIO_AF4
#define I2C2_SDA_PG9_ PG9,GPIO_AF4
#define _I2C2_SDA_PF1_ 1
#define _I2C2_SDA_PG3_ 1
#define _I2C2_SDA_PG9_ 1

#define I2C2_SMBA_PB12_ PB12,GPIO_AF4
#define I2C2_SMBA_PG1_ PG1,GPIO_AF4
#define _I2C2_SMBA_PB12_ 1
#define _I2C2_SMBA_PG1_ 1

#define I2C3_SCL_PB8_ PB8,GPIO_AF5
#define I2C3_SCL_PH12_ PH12,GPIO_AF4
#define I2C3_SCL_PH3_ PH3,GPIO_AF4
#define _I2C3_SCL_PB8_ 1
#define _I2C3_SCL_PH12_ 1
#define _I2C3_SCL_PH3_ 1

#define I2C3_SDA_PD14_ PD14,GPIO_AF4
#define I2C3_SDA_PD7_ PD7,GPIO_AF5
#define I2C3_SDA_PH14_ PH14,GPIO_AF4
#define I2C3_SDA_PH7_ PH7,GPIO_AF5
#define I2C3_SDA_PH8_ PH8,GPIO_AF4
#define _I2C3_SDA_PD14_ 1
#define _I2C3_SDA_PD7_ 1
#define _I2C3_SDA_PH14_ 1
#define _I2C3_SDA_PH7_ 1
#define _I2C3_SDA_PH8_ 1

#define I2C3_SMBA_PA9_ PA9,GPIO_AF4
#define I2C3_SMBA_PE6_ PE6,GPIO_AF5
#define _I2C3_SMBA_PA9_ 1
#define _I2C3_SMBA_PE6_ 1

#define I2C4_SCL_PB13_ PB13,GPIO_AF6
#define I2C4_SCL_PE15_ PE15,GPIO_AF6
#define I2C4_SCL_PE2_ PE2,GPIO_AF4
#define I2C4_SCL_PH11_ PH11,GPIO_AF6
#define _I2C4_SCL_PB13_ 1
#define _I2C4_SCL_PE15_ 1
#define _I2C4_SCL_PE2_ 1
#define _I2C4_SCL_PH11_ 1

#define I2C4_SDA_PA8_ PA8,GPIO_AF4
#define I2C4_SDA_PB7_ PB7,GPIO_AF6
#define I2C4_SDA_PB9_ PB9,GPIO_AF6
#define _I2C4_SDA_PA8_ 1
#define _I2C4_SDA_PB7_ 1
#define _I2C4_SDA_PB9_ 1

#define I2C4_SMBA_PB5_ PB5,GPIO_AF6
#define I2C4_SMBA_PD11_ PD11,GPIO_AF4
#define _I2C4_SMBA_PB5_ 1
#define _I2C4_SMBA_PD11_ 1

#define I2C5_SCL_PA11_ PA11,GPIO_AF4
#define I2C5_SCL_PD1_ PD1,GPIO_AF4
#define I2C5_SCL_PH13_ PH13,GPIO_AF4
#define _I2C5_SCL_PA11_ 1
#define _I2C5_SCL_PD1_ 1
#define _I2C5_SCL_PH13_ 1

#define I2C5_SDA_PE13_ PE13,GPIO_AF4
#define I2C5_SDA_PF3_ PF3,GPIO_AF4
#define I2C5_SDA_PH6_ PH6,GPIO_AF4
#define _I2C5_SDA_PE13_ 1
#define _I2C5_SDA_PF3_ 1
#define _I2C5_SDA_PH6_ 1

#define I2C5_SMBA_PB10_ PB10,GPIO_AF4
#define I2C5_SMBA_PB11_ PB11,GPIO_AF4
#define I2C5_SMBA_PD10_ PD10,GPIO_AF4
#define _I2C5_SMBA_PB10_ 1
#define _I2C5_SMBA_PB11_ 1
#define _I2C5_SMBA_PD10_ 1

#define I2S1_CK_PA7_ PA7,GPIO_AF5
#define I2S1_CK_PB1_ PB1,GPIO_AF5
#define I2S1_CK_PC3_ PC3,GPIO_AF6
#define _I2S1_CK_PA7_ 1
#define _I2S1_CK_PB1_ 1
#define _I2S1_CK_PC3_ 1

#define I2S1_MCK_PB0_ PB0,GPIO_AF5
#define I2S1_MCK_PC0_ PC0,GPIO_AF5
#define I2S1_MCK_PC4_ PC4,GPIO_AF5
#define _I2S1_MCK_PB0_ 1
#define _I2S1_MCK_PC0_ 1
#define _I2S1_MCK_PC4_ 1

#define I2S1_SDI_PA6_ PA6,GPIO_AF5
#define I2S1_SDI_PC3_ PC3,GPIO_AF5
#define _I2S1_SDI_PA6_ 1
#define _I2S1_SDI_PC3_ 1

#define I2S1_SDO_PA3_ PA3,GPIO_AF5
#define I2S1_SDO_PC0_ PC0,GPIO_AF6
#define _I2S1_SDO_PA3_ 1
#define _I2S1_SDO_PC0_ 1

#define I2S1_WS_PA4_ PA4,GPIO_AF5
#define I2S1_WS_PA5_ PA5,GPIO_AF5
#define I2S1_WS_PC2_ PC2,GPIO_AF5
#define I2S1_WS_PF12_ PF12,GPIO_AF5
#define _I2S1_WS_PA4_ 1
#define _I2S1_WS_PA5_ 1
#define _I2S1_WS_PC2_ 1
#define _I2S1_WS_PF12_ 1

#define I2S2_CK_PB10_ PB10,GPIO_AF6
#define I2S2_CK_PH6_ PH6,GPIO_AF5
#define _I2S2_CK_PB10_ 1
#define _I2S2_CK_PH6_ 1

#define I2S2_MCK_PC7_ PC7,GPIO_AF6
#define I2S2_MCK_PG11_ PG11,GPIO_AF5
#define _I2S2_MCK_PC7_ 1
#define _I2S2_MCK_PG11_ 1

#define I2S2_SDI_PB5_ PB5,GPIO_AF5
#define I2S2_SDI_PG1_ PG1,GPIO_AF5
#define _I2S2_SDI_PB5_ 1
#define _I2S2_SDI_PG1_ 1

#define I2S2_SDO_PA8_ PA8,GPIO_AF8
#define I2S2_SDO_PH10_ PH10,GPIO_AF6
#define _I2S2_SDO_PA8_ 1
#define _I2S2_SDO_PH10_ 1

#define I2S2_WS_PA11_ PA11,GPIO_AF5
#define I2S2_WS_PB13_ PB13,GPIO_AF5
#define I2S2_WS_PH11_ PH11,GPIO_AF5
#define _I2S2_WS_PA11_ 1
#define _I2S2_WS_PB13_ 1
#define _I2S2_WS_PH11_ 1

#define I2S3_CK_PC10_ PC10,GPIO_AF6
#define I2S3_CK_PH13_ PH13,GPIO_AF6
#define _I2S3_CK_PC10_ 1
#define _I2S3_CK_PH13_ 1

#define I2S3_MCK_PC6_ PC6,GPIO_AF5
#define I2S3_MCK_PH10_ PH10,GPIO_AF5
#define _I2S3_MCK_PC6_ 1
#define _I2S3_MCK_PH10_ 1

#define I2S3_SDI_PC8_ PC8,GPIO_AF5
#define I2S3_SDI_PD4_ PD4,GPIO_AF5
#define I2S3_SDI_PG7_ PG7,GPIO_AF5
#define _I2S3_SDI_PC8_ 1
#define _I2S3_SDI_PD4_ 1
#define _I2S3_SDI_PG7_ 1

#define I2S3_SDO_PC11_ PC11,GPIO_AF6
#define I2S3_SDO_PF1_ PF1,GPIO_AF5
#define _I2S3_SDO_PC11_ 1
#define _I2S3_SDO_PF1_ 1

#define I2S3_WS_PD2_ PD2,GPIO_AF5
#define I2S3_WS_PF3_ PF3,GPIO_AF6
#define _I2S3_WS_PD2_ 1
#define _I2S3_WS_PF3_ 1

#define I2S4_CK_PB4_ PB4,GPIO_AF5
#define I2S4_CK_PB7_ PB7,GPIO_AF5
#define I2S4_CK_PE12_ PE12,GPIO_AF5
#define I2S4_CK_PH9_ PH9,GPIO_AF5
#define _I2S4_CK_PB4_ 1
#define _I2S4_CK_PB7_ 1
#define _I2S4_CK_PE12_ 1
#define _I2S4_CK_PH9_ 1

#define I2S4_MCK_PA15_ PA15,GPIO_AF5
#define _I2S4_MCK_PA15_ 1

#define I2S4_SDI_PE13_ PE13,GPIO_AF5
#define I2S4_SDI_PE3_ PE3,GPIO_AF5
#define I2S4_SDI_PF3_ PF3,GPIO_AF5
#define _I2S4_SDI_PE13_ 1
#define _I2S4_SDI_PE3_ 1
#define _I2S4_SDI_PF3_ 1

#define I2S4_SDO_PB15_ PB15,GPIO_AF5
#define I2S4_SDO_PD1_ PD1,GPIO_AF5
#define I2S4_SDO_PE11_ PE11,GPIO_AF5
#define _I2S4_SDO_PB15_ 1
#define _I2S4_SDO_PD1_ 1
#define _I2S4_SDO_PE11_ 1

#define I2S4_WS_PB10_ PB10,GPIO_AF5
#define I2S4_WS_PB3_ PB3,GPIO_AF5
#define I2S4_WS_PD10_ PD10,GPIO_AF5
#define I2S4_WS_PD8_ PD8,GPIO_AF5
#define _I2S4_WS_PB10_ 1
#define _I2S4_WS_PB3_ 1
#define _I2S4_WS_PD10_ 1
#define _I2S4_WS_PD8_ 1

