susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MP13x.h
#define I2S_CKIN_PB2_ PB2,GPIO_AF5
#define I2S_CKIN_PC5_ PC5,GPIO_AF5
#define I2S_CKIN_PE4_ PE4,GPIO_AF5
#define _I2S_CKIN_PB2_ 1
#define _I2S_CKIN_PC5_ 1
#define _I2S_CKIN_PE4_ 1

#define LPTIM1_ETR_PG1_ PG1,GPIO_AF1
#define LPTIM1_ETR_PG14_ PG14,GPIO_AF1
#define _LPTIM1_ETR_PG1_ 1
#define _LPTIM1_ETR_PG14_ 1

#define LPTIM1_IN1_PD12_ PD12,GPIO_AF1
#define LPTIM1_IN1_PG12_ PG12,GPIO_AF1
#define _LPTIM1_IN1_PD12_ 1
#define _LPTIM1_IN1_PG12_ 1

#define LPTIM1_IN2_PE1_ PE1,GPIO_AF1
#define LPTIM1_IN2_PH2_ PH2,GPIO_AF1
#define _LPTIM1_IN2_PE1_ 1
#define _LPTIM1_IN2_PH2_ 1

#define LPTIM1_OUT_PB11_ PB11,GPIO_AF3
#define LPTIM1_OUT_PG13_ PG13,GPIO_AF1
#define _LPTIM1_OUT_PB11_ 1
#define _LPTIM1_OUT_PG13_ 1

#define LPTIM2_ETR_PD13_ PD13,GPIO_AF1
#define _LPTIM2_ETR_PD13_ 1

#define LPTIM2_IN1_PB10_ PB10,GPIO_AF3
#define LPTIM2_IN1_PE7_ PE7,GPIO_AF4
#define _LPTIM2_IN1_PB10_ 1
#define _LPTIM2_IN1_PE7_ 1

#define LPTIM2_IN2_PD11_ PD11,GPIO_AF3
#define LPTIM2_IN2_PF3_ PF3,GPIO_AF3
#define _LPTIM2_IN2_PD11_ 1
#define _LPTIM2_IN2_PF3_ 1

#define LPTIM2_OUT_PB13_ PB13,GPIO_AF4
#define _LPTIM2_OUT_PB13_ 1

#define LPTIM3_OUT_PA1_ PA1,GPIO_AF3
#define _LPTIM3_OUT_PA1_ 1

#define LPTIM4_OUT_PA2_ PA2,GPIO_AF3
#define _LPTIM4_OUT_PA2_ 1

#define LPTIM5_OUT_PA3_ PA3,GPIO_AF3
#define _LPTIM5_OUT_PA3_ 1

#define LTDC_B0_PB15_ PB15,GPIO_AF14
#define LTDC_B0_PD5_ PD5,GPIO_AF13
#define LTDC_B0_PD9_ PD9,GPIO_AF14
#define LTDC_B0_PH2_ PH2,GPIO_AF14
#define _LTDC_B0_PB15_ 1
#define _LTDC_B0_PD5_ 1
#define _LTDC_B0_PD9_ 1
#define _LTDC_B0_PH2_ 1

#define LTDC_B1_PB9_ PB9,GPIO_AF14
#define LTDC_B1_PC6_ PC6,GPIO_AF11
#define LTDC_B1_PE0_ PE0,GPIO_AF11
#define LTDC_B1_PE13_ PE13,GPIO_AF11
#define LTDC_B1_PG8_ PG8,GPIO_AF7
#define _LTDC_B1_PB9_ 1
#define _LTDC_B1_PC6_ 1
#define _LTDC_B1_PE0_ 1
#define _LTDC_B1_PE13_ 1
#define _LTDC_B1_PG8_ 1

#define LTDC_B2_PB3_ PB3,GPIO_AF14
#define LTDC_B2_PD10_ PD10,GPIO_AF14
#define LTDC_B2_PG11_ PG11,GPIO_AF14
#define LTDC_B2_PH7_ PH7,GPIO_AF14
#define _LTDC_B2_PB3_ 1
#define _LTDC_B2_PD10_ 1
#define _LTDC_B2_PG11_ 1
#define _LTDC_B2_PH7_ 1

#define LTDC_B3_PE7_ PE7,GPIO_AF13
#define LTDC_B3_PF2_ PF2,GPIO_AF14
#define LTDC_B3_PF8_ PF8,GPIO_AF14
#define LTDC_B3_PG15_ PG15,GPIO_AF14
#define _LTDC_B3_PE7_ 1
#define _LTDC_B3_PF2_ 1
#define _LTDC_B3_PF8_ 1
#define _LTDC_B3_PG15_ 1

#define LTDC_B4_PB2_ PB2,GPIO_AF14
#define LTDC_B4_PC9_ PC9,GPIO_AF14
#define LTDC_B4_PG15_ PG15,GPIO_AF11
#define LTDC_B4_PH14_ PH14,GPIO_AF11
#define LTDC_B4_PH3_ PH3,GPIO_AF14
#define _LTDC_B4_PB2_ 1
#define _LTDC_B4_PC9_ 1
#define _LTDC_B4_PG15_ 1
#define _LTDC_B4_PH14_ 1
#define _LTDC_B4_PH3_ 1

#define LTDC_B5_PD15_ PD15,GPIO_AF14
#define LTDC_B5_PD9_ PD9,GPIO_AF11
#define LTDC_B5_PE0_ PE0,GPIO_AF14
#define LTDC_B5_PF10_ PF10,GPIO_AF14
#define LTDC_B5_PH9_ PH9,GPIO_AF9
#define _LTDC_B5_PD15_ 1
#define _LTDC_B5_PD9_ 1
#define _LTDC_B5_PE0_ 1
#define _LTDC_B5_PF10_ 1
#define _LTDC_B5_PH9_ 1

#define LTDC_B6_PB4_ PB4,GPIO_AF13
#define LTDC_B6_PB5_ PB5,GPIO_AF13
#define LTDC_B6_PB6_ PB6,GPIO_AF7
#define LTDC_B6_PD1_ PD1,GPIO_AF11
#define LTDC_B6_PF4_ PF4,GPIO_AF14
#define LTDC_B6_PF9_ PF9,GPIO_AF14
#define _LTDC_B6_PB4_ 1
#define _LTDC_B6_PB5_ 1
#define _LTDC_B6_PB6_ 1
#define _LTDC_B6_PD1_ 1
#define _LTDC_B6_PF4_ 1
#define _LTDC_B6_PF9_ 1

#define LTDC_B7_PA8_ PA8,GPIO_AF14
#define LTDC_B7_PB6_ PB6,GPIO_AF14
#define LTDC_B7_PD10_ PD10,GPIO_AF11
#define LTDC_B7_PE15_ PE15,GPIO_AF14
#define LTDC_B7_PF1_ PF1,GPIO_AF13
#define _LTDC_B7_PA8_ 1
#define _LTDC_B7_PB6_ 1
#define _LTDC_B7_PD10_ 1
#define _LTDC_B7_PE15_ 1
#define _LTDC_B7_PF1_ 1

#define LTDC_CLK_PB13_ PB13,GPIO_AF13
#define LTDC_CLK_PB15_ PB15,GPIO_AF13
#define LTDC_CLK_PD9_ PD9,GPIO_AF13
#define _LTDC_CLK_PB13_ 1
#define _LTDC_CLK_PB15_ 1
#define _LTDC_CLK_PD9_ 1

#define LTDC_DE_PB5_ PB5,GPIO_AF14
#define LTDC_DE_PB9_ PB9,GPIO_AF13
#define LTDC_DE_PC12_ PC12,GPIO_AF14
#define LTDC_DE_PG6_ PG6,GPIO_AF13
#define LTDC_DE_PH9_ PH9,GPIO_AF11
#define _LTDC_DE_PB5_ 1
#define _LTDC_DE_PB9_ 1
#define _LTDC_DE_PC12_ 1
#define _LTDC_DE_PG6_ 1
#define _LTDC_DE_PH9_ 1

#define LTDC_G0_PE14_ PE14,GPIO_AF14
#define LTDC_G0_PF0_ PF0,GPIO_AF14
#define LTDC_G0_PF5_ PF5,GPIO_AF9
#define LTDC_G0_PG6_ PG6,GPIO_AF11
#define _LTDC_G0_PE14_ 1
#define _LTDC_G0_PF0_ 1
#define _LTDC_G0_PF5_ 1
#define _LTDC_G0_PG6_ 1

#define LTDC_G1_PB4_ PB4,GPIO_AF11
#define LTDC_G1_PF1_ PF1,GPIO_AF14
#define LTDC_G1_PH2_ PH2,GPIO_AF7
#define _LTDC_G1_PB4_ 1
#define _LTDC_G1_PF1_ 1
#define _LTDC_G1_PH2_ 1

#define LTDC_G2_PD1_ PD1,GPIO_AF14
#define LTDC_G2_PF7_ PF7,GPIO_AF14
#define LTDC_G2_PH13_ PH13,GPIO_AF14
#define _LTDC_G2_PD1_ 1
#define _LTDC_G2_PF7_ 1
#define _LTDC_G2_PH13_ 1

#define LTDC_G3_PE6_ PE6,GPIO_AF14
#define LTDC_G3_PF3_ PF3,GPIO_AF14
#define LTDC_G3_PH13_ PH13,GPIO_AF13
#define _LTDC_G3_PE6_ 1
#define _LTDC_G3_PF3_ 1
#define _LTDC_G3_PH13_ 1

#define LTDC_G4_PD13_ PD13,GPIO_AF14
#define LTDC_G4_PD5_ PD5,GPIO_AF14
#define LTDC_G4_PE12_ PE12,GPIO_AF11
#define LTDC_G4_PF2_ PF2,GPIO_AF13
#define LTDC_G4_PF6_ PF6,GPIO_AF14
#define LTDC_G4_PG5_ PG5,GPIO_AF11
#define _LTDC_G4_PD13_ 1
#define _LTDC_G4_PD5_ 1
#define _LTDC_G4_PE12_ 1
#define _LTDC_G4_PF2_ 1
#define _LTDC_G4_PF6_ 1
#define _LTDC_G4_PG5_ 1

#define LTDC_G5_PB14_ PB14,GPIO_AF14
#define LTDC_G5_PD10_ PD10,GPIO_AF9
#define LTDC_G5_PG0_ PG0,GPIO_AF14
#define _LTDC_G5_PB14_ 1
#define _LTDC_G5_PD10_ 1
#define _LTDC_G5_PG0_ 1

#define LTDC_G6_PA12_ PA12,GPIO_AF14
#define LTDC_G6_PC7_ PC7,GPIO_AF14
#define LTDC_G6_PE12_ PE12,GPIO_AF14
#define LTDC_G6_PH11_ PH11,GPIO_AF14
#define _LTDC_G6_PA12_ 1
#define _LTDC_G6_PC7_ 1
#define _LTDC_G6_PE12_ 1
#define _LTDC_G6_PH11_ 1

#define LTDC_G7_PA15_ PA15,GPIO_AF11
#define LTDC_G7_PC8_ PC8,GPIO_AF14
#define LTDC_G7_PE4_ PE4,GPIO_AF14
#define LTDC_G7_PG1_ PG1,GPIO_AF14
#define _LTDC_G7_PA15_ 1
#define _LTDC_G7_PC8_ 1
#define _LTDC_G7_PE4_ 1
#define _LTDC_G7_PG1_ 1

#define LTDC_HSYNC_PC6_ PC6,GPIO_AF14
#define LTDC_HSYNC_PE1_ PE1,GPIO_AF9
#define LTDC_HSYNC_PE9_ PE9,GPIO_AF11
#define LTDC_HSYNC_PH10_ PH10,GPIO_AF13
#define _LTDC_HSYNC_PC6_ 1
#define _LTDC_HSYNC_PE1_ 1
#define _LTDC_HSYNC_PE9_ 1
#define _LTDC_HSYNC_PH10_ 1

#define LTDC_R0_PA15_ PA15,GPIO_AF9
#define LTDC_R0_PB14_ PB14,GPIO_AF13
#define LTDC_R0_PB4_ PB4,GPIO_AF14
#define LTDC_R0_PE11_ PE11,GPIO_AF9
#define _LTDC_R0_PA15_ 1
#define _LTDC_R0_PB14_ 1
#define _LTDC_R0_PB4_ 1
#define _LTDC_R0_PE11_ 1

