susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MP13x.h
#define LTDC_R1_PC7_ PC7,GPIO_AF11
#define LTDC_R1_PD4_ PD4,GPIO_AF11
#define LTDC_R1_PE2_ PE2,GPIO_AF14
#define LTDC_R1_PG7_ PG7,GPIO_AF11
#define _LTDC_R1_PC7_ 1
#define _LTDC_R1_PD4_ 1
#define _LTDC_R1_PE2_ 1
#define _LTDC_R1_PG7_ 1

#define LTDC_R2_PG7_ PG7,GPIO_AF14
#define LTDC_R2_PH10_ PH10,GPIO_AF14
#define LTDC_R2_PH8_ PH8,GPIO_AF14
#define _LTDC_R2_PG7_ 1
#define _LTDC_R2_PH10_ 1
#define _LTDC_R2_PH8_ 1

#define LTDC_R3_PB10_ PB10,GPIO_AF14
#define LTDC_R3_PB12_ PB12,GPIO_AF13
#define _LTDC_R3_PB10_ 1
#define _LTDC_R3_PB12_ 1

#define LTDC_R4_PD14_ PD14,GPIO_AF14
#define LTDC_R4_PD4_ PD4,GPIO_AF13
#define LTDC_R4_PE1_ PE1,GPIO_AF11
#define LTDC_R4_PE3_ PE3,GPIO_AF13
#define _LTDC_R4_PD14_ 1
#define _LTDC_R4_PD4_ 1
#define _LTDC_R4_PE1_ 1
#define _LTDC_R4_PE3_ 1

#define LTDC_R5_PE11_ PE11,GPIO_AF14
#define LTDC_R5_PE7_ PE7,GPIO_AF14
#define LTDC_R5_PF5_ PF5,GPIO_AF14
#define LTDC_R5_PG7_ PG7,GPIO_AF13
#define LTDC_R5_PH3_ PH3,GPIO_AF11
#define _LTDC_R5_PE11_ 1
#define _LTDC_R5_PE7_ 1
#define _LTDC_R5_PF5_ 1
#define _LTDC_R5_PG7_ 1
#define _LTDC_R5_PH3_ 1

#define LTDC_R6_PA9_ PA9,GPIO_AF14
#define LTDC_R6_PB3_ PB3,GPIO_AF11
#define LTDC_R6_PC6_ PC6,GPIO_AF13
#define LTDC_R6_PD4_ PD4,GPIO_AF14
#define LTDC_R6_PE13_ PE13,GPIO_AF14
#define LTDC_R6_PF0_ PF0,GPIO_AF13
#define LTDC_R6_PH8_ PH8,GPIO_AF11
#define _LTDC_R6_PA9_ 1
#define _LTDC_R6_PB3_ 1
#define _LTDC_R6_PC6_ 1
#define _LTDC_R6_PD4_ 1
#define _LTDC_R6_PE13_ 1
#define _LTDC_R6_PF0_ 1
#define _LTDC_R6_PH8_ 1

#define LTDC_R7_PD11_ PD11,GPIO_AF11
#define LTDC_R7_PE9_ PE9,GPIO_AF14
#define LTDC_R7_PF6_ PF6,GPIO_AF13
#define LTDC_R7_PG6_ PG6,GPIO_AF14
#define _LTDC_R7_PD11_ 1
#define _LTDC_R7_PE9_ 1
#define _LTDC_R7_PF6_ 1
#define _LTDC_R7_PG6_ 1

#define LTDC_VSYNC_PB12_ PB12,GPIO_AF14
#define LTDC_VSYNC_PE12_ PE12,GPIO_AF9
#define LTDC_VSYNC_PG4_ PG4,GPIO_AF11
#define _LTDC_VSYNC_PB12_ 1
#define _LTDC_VSYNC_PE12_ 1
#define _LTDC_VSYNC_PG4_ 1

#define QUADSPI_BK1_IO0_PD5_ PD5,GPIO_AF9
#define QUADSPI_BK1_IO0_PF8_ PF8,GPIO_AF10
#define QUADSPI_BK1_IO0_PH3_ PH3,GPIO_AF13
#define _QUADSPI_BK1_IO0_PD5_ 1
#define _QUADSPI_BK1_IO0_PF8_ 1
#define _QUADSPI_BK1_IO0_PH3_ 1

#define QUADSPI_BK1_IO1_PE9_ PE9,GPIO_AF9
#define QUADSPI_BK1_IO1_PF9_ PF9,GPIO_AF10
#define QUADSPI_BK1_IO1_PG15_ PG15,GPIO_AF9
#define _QUADSPI_BK1_IO1_PE9_ 1
#define _QUADSPI_BK1_IO1_PF9_ 1
#define _QUADSPI_BK1_IO1_PG15_ 1

#define QUADSPI_BK1_IO2_PD11_ PD11,GPIO_AF9
#define QUADSPI_BK1_IO2_PD7_ PD7,GPIO_AF11
#define QUADSPI_BK1_IO2_PF6_ PF6,GPIO_AF9
#define QUADSPI_BK1_IO2_PH6_ PH6,GPIO_AF9
#define _QUADSPI_BK1_IO2_PD11_ 1
#define _QUADSPI_BK1_IO2_PD7_ 1
#define _QUADSPI_BK1_IO2_PF6_ 1
#define _QUADSPI_BK1_IO2_PH6_ 1

#define QUADSPI_BK1_IO3_PD13_ PD13,GPIO_AF9
#define QUADSPI_BK1_IO3_PD15_ PD15,GPIO_AF9
#define QUADSPI_BK1_IO3_PG8_ PG8,GPIO_AF11
#define QUADSPI_BK1_IO3_PH7_ PH7,GPIO_AF13
#define _QUADSPI_BK1_IO3_PD13_ 1
#define _QUADSPI_BK1_IO3_PD15_ 1
#define _QUADSPI_BK1_IO3_PG8_ 1
#define _QUADSPI_BK1_IO3_PH7_ 1

#define QUADSPI_BK1_NCS_PB2_ PB2,GPIO_AF9
#define QUADSPI_BK1_NCS_PB6_ PB6,GPIO_AF9
#define QUADSPI_BK1_NCS_PD1_ PD1,GPIO_AF9
#define QUADSPI_BK1_NCS_PE14_ PE14,GPIO_AF9
#define QUADSPI_BK1_NCS_PH6_ PH6,GPIO_AF13
#define _QUADSPI_BK1_NCS_PB2_ 1
#define _QUADSPI_BK1_NCS_PB6_ 1
#define _QUADSPI_BK1_NCS_PD1_ 1
#define _QUADSPI_BK1_NCS_PE14_ 1
#define _QUADSPI_BK1_NCS_PH6_ 1

#define QUADSPI_BK2_IO0_PH11_ PH11,GPIO_AF9
#define QUADSPI_BK2_IO0_PH2_ PH2,GPIO_AF9
#define _QUADSPI_BK2_IO0_PH11_ 1
#define _QUADSPI_BK2_IO0_PH2_ 1

#define QUADSPI_BK2_IO1_PG10_ PG10,GPIO_AF10
#define QUADSPI_BK2_IO1_PH3_ PH3,GPIO_AF9
#define _QUADSPI_BK2_IO1_PG10_ 1
#define _QUADSPI_BK2_IO1_PH3_ 1

#define QUADSPI_BK2_IO2_PD13_ PD13,GPIO_AF11
#define QUADSPI_BK2_IO2_PE14_ PE14,GPIO_AF10
#define QUADSPI_BK2_IO2_PG8_ PG8,GPIO_AF10
#define QUADSPI_BK2_IO2_PH12_ PH12,GPIO_AF9
#define _QUADSPI_BK2_IO2_PD13_ 1
#define _QUADSPI_BK2_IO2_PE14_ 1
#define _QUADSPI_BK2_IO2_PG8_ 1
#define _QUADSPI_BK2_IO2_PH12_ 1

#define QUADSPI_BK2_IO3_PF9_ PF9,GPIO_AF11
#define QUADSPI_BK2_IO3_PH7_ PH7,GPIO_AF9
#define _QUADSPI_BK2_IO3_PF9_ 1
#define _QUADSPI_BK2_IO3_PH7_ 1

#define QUADSPI_BK2_NCS_PE4_ PE4,GPIO_AF9
#define _QUADSPI_BK2_NCS_PE4_ 1

#define QUADSPI_CLK_PD4_ PD4,GPIO_AF9
#define QUADSPI_CLK_PF10_ PF10,GPIO_AF9
#define _QUADSPI_CLK_PD4_ 1
#define _QUADSPI_CLK_PF10_ 1

#define RCC_MCO_1_PA13_ PA13,GPIO_AF2
#define RCC_MCO_1_PA8_ PA8,GPIO_AF0
#define RCC_MCO_1_PD7_ PD7,GPIO_AF0
#define _RCC_MCO_1_PA13_ 1
#define _RCC_MCO_1_PA8_ 1
#define _RCC_MCO_1_PD7_ 1

#define RCC_MCO_2_PA14_ PA14,GPIO_AF2
#define RCC_MCO_2_PE6_ PE6,GPIO_AF0
#define RCC_MCO_2_PG2_ PG2,GPIO_AF1
#define _RCC_MCO_2_PA14_ 1
#define _RCC_MCO_2_PE6_ 1
#define _RCC_MCO_2_PG2_ 1

#define RTC_OUT2_PB2_ PB2,GPIO_AF1
#define _RTC_OUT2_PB2_ 1

#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define RTC_REFIN_PD10_ PD10,GPIO_AF0
#define _RTC_REFIN_PB15_ 1
#define _RTC_REFIN_PD10_ 1

#define SAI1_CK1_PC3_ PC3,GPIO_AF2
#define SAI1_CK1_PD0_ PD0,GPIO_AF6
#define SAI1_CK1_PD13_ PD13,GPIO_AF4
#define _SAI1_CK1_PC3_ 1
#define _SAI1_CK1_PD0_ 1
#define _SAI1_CK1_PD13_ 1

#define SAI1_CK2_PB6_ PB6,GPIO_AF6
#define SAI1_CK2_PC0_ PC0,GPIO_AF4
#define SAI1_CK2_PH12_ PH12,GPIO_AF10
#define _SAI1_CK2_PB6_ 1
#define _SAI1_CK2_PC0_ 1
#define _SAI1_CK2_PH12_ 1

#define SAI1_D1_PA5_ PA5,GPIO_AF4
#define SAI1_D1_PB2_ PB2,GPIO_AF2
#define SAI1_D1_PB8_ PB8,GPIO_AF10
#define SAI1_D1_PD6_ PD6,GPIO_AF2
#define _SAI1_D1_PA5_ 1
#define _SAI1_D1_PB2_ 1
#define _SAI1_D1_PB8_ 1
#define _SAI1_D1_PD6_ 1

#define SAI1_D2_PE11_ PE11,GPIO_AF4
#define SAI1_D2_PE4_ PE4,GPIO_AF2
#define SAI1_D2_PF11_ PF11,GPIO_AF2
#define _SAI1_D2_PE11_ 1
#define _SAI1_D2_PE4_ 1
#define _SAI1_D2_PF11_ 1

#define SAI1_D3_PC1_ PC1,GPIO_AF6
#define SAI1_D3_PC4_ PC4,GPIO_AF4
#define SAI1_D3_PD3_ PD3,GPIO_AF6
#define SAI1_D3_PF10_ PF10,GPIO_AF2
#define _SAI1_D3_PC1_ 1
#define _SAI1_D3_PC4_ 1
#define _SAI1_D3_PD3_ 1
#define _SAI1_D3_PF10_ 1

#define SAI1_D4_PC5_ PC5,GPIO_AF6
#define SAI1_D4_PE14_ PE14,GPIO_AF4
#define SAI1_D4_PF9_ PF9,GPIO_AF6
#define _SAI1_D4_PC5_ 1
#define _SAI1_D4_PE14_ 1
#define _SAI1_D4_PF9_ 1

#define SAI1_FS_A_PE11_ PE11,GPIO_AF6
#define SAI1_FS_A_PE4_ PE4,GPIO_AF6
#define SAI1_FS_A_PF11_ PF11,GPIO_AF6
#define _SAI1_FS_A_PE11_ 1
#define _SAI1_FS_A_PE4_ 1
#define _SAI1_FS_A_PF11_ 1

