susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MP13x.h
#define SAI1_FS_B_PA3_ PA3,GPIO_AF6
#define SAI1_FS_B_PE2_ PE2,GPIO_AF6
#define _SAI1_FS_B_PA3_ 1
#define _SAI1_FS_B_PE2_ 1

#define SAI1_MCLK_A_PC3_ PC3,GPIO_AF10
#define SAI1_MCLK_A_PD0_ PD0,GPIO_AF2
#define SAI1_MCLK_A_PD13_ PD13,GPIO_AF6
#define _SAI1_MCLK_A_PC3_ 1
#define _SAI1_MCLK_A_PD0_ 1
#define _SAI1_MCLK_A_PD13_ 1

#define SAI1_MCLK_B_PF13_ PF13,GPIO_AF2
#define SAI1_MCLK_B_PG8_ PG8,GPIO_AF6
#define _SAI1_MCLK_B_PF13_ 1
#define _SAI1_MCLK_B_PG8_ 1

#define SAI1_SCK_A_PA4_ PA4,GPIO_AF12
#define SAI1_SCK_A_PC0_ PC0,GPIO_AF2
#define SAI1_SCK_A_PH12_ PH12,GPIO_AF6
#define _SAI1_SCK_A_PA4_ 1
#define _SAI1_SCK_A_PC0_ 1
#define _SAI1_SCK_A_PH12_ 1

#define SAI1_SCK_B_PA4_ PA4,GPIO_AF4
#define SAI1_SCK_B_PE6_ PE6,GPIO_AF6
#define SAI1_SCK_B_PF8_ PF8,GPIO_AF6
#define _SAI1_SCK_B_PA4_ 1
#define _SAI1_SCK_B_PE6_ 1
#define _SAI1_SCK_B_PF8_ 1

#define SAI1_SD_A_PA5_ PA5,GPIO_AF6
#define SAI1_SD_A_PB2_ PB2,GPIO_AF6
#define SAI1_SD_A_PD6_ PD6,GPIO_AF6
#define SAI1_SD_A_PF12_ PF12,GPIO_AF6
#define _SAI1_SD_A_PA5_ 1
#define _SAI1_SD_A_PB2_ 1
#define _SAI1_SD_A_PD6_ 1
#define _SAI1_SD_A_PF12_ 1

#define SAI1_SD_B_PA0_ PA0,GPIO_AF6
#define SAI1_SD_B_PG10_ PG10,GPIO_AF6
#define _SAI1_SD_B_PA0_ 1
#define _SAI1_SD_B_PG10_ 1

#define SAI2_CK1_PA8_ PA8,GPIO_AF6
#define SAI2_CK1_PB3_ PB3,GPIO_AF4
#define SAI2_CK1_PC2_ PC2,GPIO_AF10
#define _SAI2_CK1_PA8_ 1
#define _SAI2_CK1_PB3_ 1
#define _SAI2_CK1_PC2_ 1

#define SAI2_CK2_PA6_ PA6,GPIO_AF4
#define SAI2_CK2_PB4_ PB4,GPIO_AF4
#define SAI2_CK2_PG12_ PG12,GPIO_AF6
#define _SAI2_CK2_PA6_ 1
#define _SAI2_CK2_PB4_ 1
#define _SAI2_CK2_PG12_ 1

#define SAI2_D1_PA7_ PA7,GPIO_AF4
#define SAI2_D1_PD2_ PD2,GPIO_AF6
#define SAI2_D1_PG14_ PG14,GPIO_AF6
#define SAI2_D1_PG6_ PG6,GPIO_AF3
#define _SAI2_D1_PA7_ 1
#define _SAI2_D1_PD2_ 1
#define _SAI2_D1_PG14_ 1
#define _SAI2_D1_PG6_ 1

#define SAI2_D2_PB0_ PB0,GPIO_AF10
#define SAI2_D2_PB15_ PB15,GPIO_AF4
#define SAI2_D2_PG1_ PG1,GPIO_AF6
#define _SAI2_D2_PB0_ 1
#define _SAI2_D2_PB15_ 1
#define _SAI2_D2_PG1_ 1

#define SAI2_D3_PC4_ PC4,GPIO_AF12
#define SAI2_D3_PG11_ PG11,GPIO_AF4
#define SAI2_D3_PH10_ PH10,GPIO_AF3
#define _SAI2_D3_PC4_ 1
#define _SAI2_D3_PG11_ 1
#define _SAI2_D3_PH10_ 1

#define SAI2_D4_PC5_ PC5,GPIO_AF4
#define SAI2_D4_PE3_ PE3,GPIO_AF2
#define _SAI2_D4_PC5_ 1
#define _SAI2_D4_PE3_ 1

#define SAI2_FS_A_PB0_ PB0,GPIO_AF6
#define SAI2_FS_A_PB15_ PB15,GPIO_AF12
#define SAI2_FS_A_PG1_ PG1,GPIO_AF3
#define _SAI2_FS_A_PB0_ 1
#define _SAI2_FS_A_PB15_ 1
#define _SAI2_FS_A_PG1_ 1

#define SAI2_FS_B_PC8_ PC8,GPIO_AF10
#define SAI2_FS_B_PH7_ PH7,GPIO_AF2
#define _SAI2_FS_B_PC8_ 1
#define _SAI2_FS_B_PH7_ 1

#define SAI2_MCLK_A_PA12_ PA12,GPIO_AF2
#define SAI2_MCLK_A_PA8_ PA8,GPIO_AF2
#define SAI2_MCLK_A_PB3_ PB3,GPIO_AF12
#define SAI2_MCLK_A_PC2_ PC2,GPIO_AF6
#define _SAI2_MCLK_A_PA12_ 1
#define _SAI2_MCLK_A_PA8_ 1
#define _SAI2_MCLK_A_PB3_ 1
#define _SAI2_MCLK_A_PC2_ 1

#define SAI2_MCLK_B_PC10_ PC10,GPIO_AF10
#define SAI2_MCLK_B_PG2_ PG2,GPIO_AF10
#define _SAI2_MCLK_B_PC10_ 1
#define _SAI2_MCLK_B_PG2_ 1

#define SAI2_SCK_A_PA6_ PA6,GPIO_AF12
#define SAI2_SCK_A_PB4_ PB4,GPIO_AF12
#define SAI2_SCK_A_PG12_ PG12,GPIO_AF4
#define _SAI2_SCK_A_PA6_ 1
#define _SAI2_SCK_A_PB4_ 1
#define _SAI2_SCK_A_PG12_ 1

#define SAI2_SCK_B_PC11_ PC11,GPIO_AF10
#define SAI2_SCK_B_PE5_ PE5,GPIO_AF2
#define SAI2_SCK_B_PE6_ PE6,GPIO_AF2
#define _SAI2_SCK_B_PC11_ 1
#define _SAI2_SCK_B_PE5_ 1
#define _SAI2_SCK_B_PE6_ 1

#define SAI2_SD_A_PA7_ PA7,GPIO_AF12
#define SAI2_SD_A_PG14_ PG14,GPIO_AF10
#define SAI2_SD_A_PG6_ PG6,GPIO_AF6
#define SAI2_SD_A_PH11_ PH11,GPIO_AF3
#define _SAI2_SD_A_PA7_ 1
#define _SAI2_SD_A_PG14_ 1
#define _SAI2_SD_A_PG6_ 1
#define _SAI2_SD_A_PH11_ 1

#define SAI2_SD_B_PC12_ PC12,GPIO_AF10
#define SAI2_SD_B_PG3_ PG3,GPIO_AF6
#define _SAI2_SD_B_PC12_ 1
#define _SAI2_SD_B_PG3_ 1

#define SDMMC1_CDIR_PB9_ PB9,GPIO_AF12
#define _SDMMC1_CDIR_PB9_ 1

#define SDMMC1_CK_PC12_ PC12,GPIO_AF12
#define _SDMMC1_CK_PC12_ 1

#define SDMMC1_CKIN_PB15_ PB15,GPIO_AF8
#define SDMMC1_CKIN_PB5_ PB5,GPIO_AF8
#define _SDMMC1_CKIN_PB15_ 1
#define _SDMMC1_CKIN_PB5_ 1

#define SDMMC1_CMD_PD2_ PD2,GPIO_AF12
#define _SDMMC1_CMD_PD2_ 1

#define SDMMC1_D0_PC8_ PC8,GPIO_AF12
#define _SDMMC1_D0_PC8_ 1

#define SDMMC1_D0DIR_PF2_ PF2,GPIO_AF11
#define _SDMMC1_D0DIR_PF2_ 1

#define SDMMC1_D1_PC9_ PC9,GPIO_AF12
#define _SDMMC1_D1_PC9_ 1

#define SDMMC1_D123DIR_PB13_ PB13,GPIO_AF8
#define SDMMC1_D123DIR_PB3_ PB3,GPIO_AF8
#define _SDMMC1_D123DIR_PB13_ 1
#define _SDMMC1_D123DIR_PB3_ 1

#define SDMMC1_D2_PC10_ PC10,GPIO_AF12
#define _SDMMC1_D2_PC10_ 1

#define SDMMC1_D3_PC11_ PC11,GPIO_AF12
#define _SDMMC1_D3_PC11_ 1

#define SDMMC1_D4_PB14_ PB14,GPIO_AF11
#define SDMMC1_D4_PH10_ PH10,GPIO_AF8
#define _SDMMC1_D4_PB14_ 1
#define _SDMMC1_D4_PH10_ 1

#define SDMMC1_D5_PB12_ PB12,GPIO_AF12
#define _SDMMC1_D5_PB12_ 1

#define SDMMC1_D6_PC6_ PC6,GPIO_AF8
#define _SDMMC1_D6_PC6_ 1

#define SDMMC1_D7_PC7_ PC7,GPIO_AF12
#define _SDMMC1_D7_PC7_ 1

#define SDMMC2_CDIR_PC7_ PC7,GPIO_AF9
#define SDMMC2_CDIR_PD9_ PD9,GPIO_AF10
#define _SDMMC2_CDIR_PC7_ 1
#define _SDMMC2_CDIR_PD9_ 1

#define SDMMC2_CK_PE3_ PE3,GPIO_AF10
#define _SDMMC2_CK_PE3_ 1

#define SDMMC2_CKIN_PG7_ PG7,GPIO_AF10
#define _SDMMC2_CKIN_PG7_ 1

#define SDMMC2_CMD_PG6_ PG6,GPIO_AF10
#define _SDMMC2_CMD_PG6_ 1

#define SDMMC2_D0_PB14_ PB14,GPIO_AF10
#define _SDMMC2_D0_PB14_ 1

#define SDMMC2_D0DIR_PC6_ PC6,GPIO_AF9
#define SDMMC2_D0DIR_PF2_ PF2,GPIO_AF9
#define _SDMMC2_D0DIR_PC6_ 1
#define _SDMMC2_D0DIR_PF2_ 1

#define SDMMC2_D1_PB15_ PB15,GPIO_AF10
#define _SDMMC2_D1_PB15_ 1

#define SDMMC2_D123DIR_PG4_ PG4,GPIO_AF10
#define _SDMMC2_D123DIR_PG4_ 1

#define SDMMC2_D2_PB3_ PB3,GPIO_AF10
#define _SDMMC2_D2_PB3_ 1

#define SDMMC2_D3_PB4_ PB4,GPIO_AF10
#define _SDMMC2_D3_PB4_ 1

#define SDMMC2_D4_PF0_ PF0,GPIO_AF10
#define _SDMMC2_D4_PF0_ 1

#define SDMMC2_D5_PB9_ PB9,GPIO_AF10
#define _SDMMC2_D5_PB9_ 1

#define SDMMC2_D6_PC6_ PC6,GPIO_AF10
#define _SDMMC2_D6_PC6_ 1

#define SDMMC2_D7_PC7_ PC7,GPIO_AF10
#define _SDMMC2_D7_PC7_ 1

#define SPDIFRX_IN0_PD11_ PD11,GPIO_AF8
#define SPDIFRX_IN0_PD7_ PD7,GPIO_AF9
#define SPDIFRX_IN0_PI0_ PI0,GPIO_AF8
#define _SPDIFRX_IN0_PD11_ 1
#define _SPDIFRX_IN0_PD7_ 1
#define _SPDIFRX_IN0_PI0_ 1

