susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MP13x.h
#define SPDIFRX_IN1_PE2_ PE2,GPIO_AF9
#define SPDIFRX_IN1_PI1_ PI1,GPIO_AF8
#define _SPDIFRX_IN1_PE2_ 1
#define _SPDIFRX_IN1_PI1_ 1

#define SPDIFRX_IN2_PC4_ PC4,GPIO_AF9
#define SPDIFRX_IN2_PG8_ PG8,GPIO_AF9
#define SPDIFRX_IN2_PI2_ PI2,GPIO_AF8
#define _SPDIFRX_IN2_PC4_ 1
#define _SPDIFRX_IN2_PG8_ 1
#define _SPDIFRX_IN2_PI2_ 1

#define SPDIFRX_IN3_PC5_ PC5,GPIO_AF9
#define SPDIFRX_IN3_PG9_ PG9,GPIO_AF8
#define SPDIFRX_IN3_PI3_ PI3,GPIO_AF8
#define _SPDIFRX_IN3_PC5_ 1
#define _SPDIFRX_IN3_PG9_ 1
#define _SPDIFRX_IN3_PI3_ 1

#define SPI1_MISO_PA6_ PA6,GPIO_AF5
#define SPI1_MISO_PC3_ PC3,GPIO_AF5
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PC3_ 1

#define SPI1_MOSI_PA3_ PA3,GPIO_AF5
#define SPI1_MOSI_PC0_ PC0,GPIO_AF6
#define _SPI1_MOSI_PA3_ 1
#define _SPI1_MOSI_PC0_ 1

#define SPI1_NSS_PA4_ PA4,GPIO_AF5
#define SPI1_NSS_PA5_ PA5,GPIO_AF5
#define SPI1_NSS_PC2_ PC2,GPIO_AF5
#define SPI1_NSS_PF12_ PF12,GPIO_AF5
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PA5_ 1
#define _SPI1_NSS_PC2_ 1
#define _SPI1_NSS_PF12_ 1

#define SPI1_SCK_PA7_ PA7,GPIO_AF5
#define SPI1_SCK_PB1_ PB1,GPIO_AF5
#define SPI1_SCK_PC3_ PC3,GPIO_AF6
#define _SPI1_SCK_PA7_ 1
#define _SPI1_SCK_PB1_ 1
#define _SPI1_SCK_PC3_ 1

#define SPI2_MISO_PB5_ PB5,GPIO_AF5
#define SPI2_MISO_PG1_ PG1,GPIO_AF5
#define _SPI2_MISO_PB5_ 1
#define _SPI2_MISO_PG1_ 1

#define SPI2_MOSI_PA8_ PA8,GPIO_AF8
#define SPI2_MOSI_PH10_ PH10,GPIO_AF6
#define _SPI2_MOSI_PA8_ 1
#define _SPI2_MOSI_PH10_ 1

#define SPI2_NSS_PA11_ PA11,GPIO_AF5
#define SPI2_NSS_PB13_ PB13,GPIO_AF5
#define SPI2_NSS_PH11_ PH11,GPIO_AF5
#define _SPI2_NSS_PA11_ 1
#define _SPI2_NSS_PB13_ 1
#define _SPI2_NSS_PH11_ 1

#define SPI2_SCK_PB10_ PB10,GPIO_AF6
#define SPI2_SCK_PH6_ PH6,GPIO_AF5
#define _SPI2_SCK_PB10_ 1
#define _SPI2_SCK_PH6_ 1

#define SPI3_MISO_PC8_ PC8,GPIO_AF5
#define SPI3_MISO_PD4_ PD4,GPIO_AF5
#define SPI3_MISO_PG7_ PG7,GPIO_AF5
#define _SPI3_MISO_PC8_ 1
#define _SPI3_MISO_PD4_ 1
#define _SPI3_MISO_PG7_ 1

#define SPI3_MOSI_PC11_ PC11,GPIO_AF6
#define SPI3_MOSI_PF1_ PF1,GPIO_AF5
#define _SPI3_MOSI_PC11_ 1
#define _SPI3_MOSI_PF1_ 1

#define SPI3_NSS_PD2_ PD2,GPIO_AF5
#define SPI3_NSS_PF3_ PF3,GPIO_AF6
#define _SPI3_NSS_PD2_ 1
#define _SPI3_NSS_PF3_ 1

#define SPI3_SCK_PC10_ PC10,GPIO_AF6
#define SPI3_SCK_PH13_ PH13,GPIO_AF6
#define _SPI3_SCK_PC10_ 1
#define _SPI3_SCK_PH13_ 1

#define SPI4_MISO_PE13_ PE13,GPIO_AF5
#define SPI4_MISO_PE3_ PE3,GPIO_AF5
#define SPI4_MISO_PF3_ PF3,GPIO_AF5
#define _SPI4_MISO_PE13_ 1
#define _SPI4_MISO_PE3_ 1
#define _SPI4_MISO_PF3_ 1

#define SPI4_MOSI_PB15_ PB15,GPIO_AF5
#define SPI4_MOSI_PD1_ PD1,GPIO_AF5
#define SPI4_MOSI_PE11_ PE11,GPIO_AF5
#define _SPI4_MOSI_PB15_ 1
#define _SPI4_MOSI_PD1_ 1
#define _SPI4_MOSI_PE11_ 1

#define SPI4_NSS_PB10_ PB10,GPIO_AF5
#define SPI4_NSS_PB3_ PB3,GPIO_AF5
#define SPI4_NSS_PD10_ PD10,GPIO_AF5
#define _SPI4_NSS_PB10_ 1
#define _SPI4_NSS_PB3_ 1
#define _SPI4_NSS_PD10_ 1

#define SPI4_SCK_PB4_ PB4,GPIO_AF5
#define SPI4_SCK_PE12_ PE12,GPIO_AF5
#define SPI4_SCK_PH9_ PH9,GPIO_AF5
#define _SPI4_SCK_PB4_ 1
#define _SPI4_SCK_PE12_ 1
#define _SPI4_SCK_PH9_ 1

#define SPI5_MISO_PA8_ PA8,GPIO_AF5
#define SPI5_MISO_PE4_ PE4,GPIO_AF1
#define SPI5_MISO_PG8_ PG8,GPIO_AF5
#define _SPI5_MISO_PA8_ 1
#define _SPI5_MISO_PE4_ 1
#define _SPI5_MISO_PG8_ 1

#define SPI5_MOSI_PE2_ PE2,GPIO_AF5
#define SPI5_MOSI_PH12_ PH12,GPIO_AF5
#define SPI5_MOSI_PH3_ PH3,GPIO_AF5
#define _SPI5_MOSI_PE2_ 1
#define _SPI5_MOSI_PH12_ 1
#define _SPI5_MOSI_PH3_ 1

#define SPI5_NSS_PC2_ PC2,GPIO_AF1
#define SPI5_NSS_PF10_ PF10,GPIO_AF5
#define SPI5_NSS_PF6_ PF6,GPIO_AF5
#define SPI5_NSS_PH11_ PH11,GPIO_AF1
#define _SPI5_NSS_PC2_ 1
#define _SPI5_NSS_PF10_ 1
#define _SPI5_NSS_PF6_ 1
#define _SPI5_NSS_PH11_ 1

#define SPI5_SCK_PG10_ PG10,GPIO_AF5
#define SPI5_SCK_PH7_ PH7,GPIO_AF6
#define _SPI5_SCK_PG10_ 1
#define _SPI5_SCK_PH7_ 1

#define TIM12_CH1_PB14_ PB14,GPIO_AF2
#define TIM12_CH1_PH6_ PH6,GPIO_AF2
#define _TIM12_CH1_PB14_ 1
#define _TIM12_CH1_PH6_ 1

#define TIM12_CH2_PB15_ PB15,GPIO_AF2
#define TIM12_CH2_PH9_ PH9,GPIO_AF2
#define _TIM12_CH2_PB15_ 1
#define _TIM12_CH2_PH9_ 1

#define TIM13_CH1_PA6_ PA6,GPIO_AF9
#define TIM13_CH1_PF8_ PF8,GPIO_AF9
#define _TIM13_CH1_PA6_ 1
#define _TIM13_CH1_PF8_ 1

#define TIM14_CH1_PA7_ PA7,GPIO_AF9
#define TIM14_CH1_PF9_ PF9,GPIO_AF9
#define _TIM14_CH1_PA7_ 1
#define _TIM14_CH1_PF9_ 1

#define TIM15_BKIN_PA0_ PA0,GPIO_AF4
#define TIM15_BKIN_PE3_ PE3,GPIO_AF4
#define _TIM15_BKIN_PA0_ 1
#define _TIM15_BKIN_PE3_ 1

#define TIM15_CH1_PA2_ PA2,GPIO_AF4
#define TIM15_CH1_PE5_ PE5,GPIO_AF4
#define _TIM15_CH1_PA2_ 1
#define _TIM15_CH1_PE5_ 1

#define TIM15_CH1N_PA1_ PA1,GPIO_AF4
#define TIM15_CH1N_PE4_ PE4,GPIO_AF4
#define _TIM15_CH1N_PA1_ 1
#define _TIM15_CH1N_PE4_ 1

#define TIM15_CH2_PA3_ PA3,GPIO_AF4
#define TIM15_CH2_PE6_ PE6,GPIO_AF4
#define _TIM15_CH2_PA3_ 1
#define _TIM15_CH2_PE6_ 1

#define TIM16_BKIN_PB4_ PB4,GPIO_AF1
#define TIM16_BKIN_PF10_ PF10,GPIO_AF1
#define _TIM16_BKIN_PB4_ 1
#define _TIM16_BKIN_PF10_ 1

#define TIM16_CH1_PB8_ PB8,GPIO_AF1
#define TIM16_CH1_PF6_ PF6,GPIO_AF1
#define _TIM16_CH1_PB8_ 1
#define _TIM16_CH1_PF6_ 1

#define TIM16_CH1N_PB6_ PB6,GPIO_AF1
#define TIM16_CH1N_PD6_ PD6,GPIO_AF1
#define TIM16_CH1N_PF8_ PF8,GPIO_AF1
#define _TIM16_CH1N_PB6_ 1
#define _TIM16_CH1N_PD6_ 1
#define _TIM16_CH1N_PF8_ 1

#define TIM17_BKIN_PB5_ PB5,GPIO_AF1
#define TIM17_BKIN_PG6_ PG6,GPIO_AF1
#define _TIM17_BKIN_PB5_ 1
#define _TIM17_BKIN_PG6_ 1

#define TIM17_CH1_PF7_ PF7,GPIO_AF1
#define TIM17_CH1_PG5_ PG5,GPIO_AF1
#define _TIM17_CH1_PF7_ 1
#define _TIM17_CH1_PG5_ 1

#define TIM17_CH1N_PB7_ PB7,GPIO_AF1
#define TIM17_CH1N_PF9_ PF9,GPIO_AF1
#define _TIM17_CH1N_PB7_ 1
#define _TIM17_CH1N_PF9_ 1

#define TIM1_BKIN_PA6_ PA6,GPIO_AF1
#define TIM1_BKIN_PE14_ PE14,GPIO_AF1
#define TIM1_BKIN_PE15_ PE15,GPIO_AF2
#define _TIM1_BKIN_PA6_ 1
#define _TIM1_BKIN_PE14_ 1
#define _TIM1_BKIN_PE15_ 1

#define TIM1_BKIN2_PE6_ PE6,GPIO_AF1
#define TIM1_BKIN2_PG4_ PG4,GPIO_AF1
#define _TIM1_BKIN2_PE6_ 1
#define _TIM1_BKIN2_PG4_ 1

#define TIM1_CH1_PE9_ PE9,GPIO_AF1
#define TIM1_CH1_PF9_ PF9,GPIO_AF2
#define _TIM1_CH1_PE9_ 1
#define _TIM1_CH1_PF9_ 1

#define TIM1_CH1N_PA7_ PA7,GPIO_AF1
#define TIM1_CH1N_PB13_ PB13,GPIO_AF1
#define TIM1_CH1N_PE8_ PE8,GPIO_AF1
#define _TIM1_CH1N_PA7_ 1
#define _TIM1_CH1N_PB13_ 1
#define _TIM1_CH1N_PE8_ 1

#define TIM1_CH2_PA9_ PA9,GPIO_AF1
#define TIM1_CH2_PE11_ PE11,GPIO_AF1
#define _TIM1_CH2_PA9_ 1
#define _TIM1_CH2_PE11_ 1

#define TIM1_CH2N_PB0_ PB0,GPIO_AF1
#define TIM1_CH2N_PB14_ PB14,GPIO_AF1
#define TIM1_CH2N_PE10_ PE10,GPIO_AF1
#define _TIM1_CH2N_PB0_ 1
#define _TIM1_CH2N_PB14_ 1
#define _TIM1_CH2N_PE10_ 1

