susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MP13x.h
#define TIM1_CH3_PA10_ PA10,GPIO_AF1
#define TIM1_CH3_PE13_ PE13,GPIO_AF1
#define _TIM1_CH3_PA10_ 1
#define _TIM1_CH3_PE13_ 1

#define TIM1_CH3N_PB1_ PB1,GPIO_AF1
#define TIM1_CH3N_PB15_ PB15,GPIO_AF1
#define TIM1_CH3N_PE12_ PE12,GPIO_AF1
#define _TIM1_CH3N_PB1_ 1
#define _TIM1_CH3N_PB15_ 1
#define _TIM1_CH3N_PE12_ 1

#define TIM1_CH4_PA11_ PA11,GPIO_AF1
#define TIM1_CH4_PH9_ PH9,GPIO_AF1
#define _TIM1_CH4_PA11_ 1
#define _TIM1_CH4_PH9_ 1

#define TIM1_ETR_PA12_ PA12,GPIO_AF1
#define TIM1_ETR_PE7_ PE7,GPIO_AF1
#define TIM1_ETR_PG7_ PG7,GPIO_AF1
#define _TIM1_ETR_PA12_ 1
#define _TIM1_ETR_PE7_ 1
#define _TIM1_ETR_PG7_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF1
#define TIM2_CH1_PA15_ PA15,GPIO_AF1
#define TIM2_CH1_PA5_ PA5,GPIO_AF1
#define TIM2_CH1_PD3_ PD3,GPIO_AF2
#define TIM2_CH1_PE15_ PE15,GPIO_AF1
#define TIM2_CH1_PE2_ PE2,GPIO_AF1
#define TIM2_CH1_PF13_ PF13,GPIO_AF1
#define TIM2_CH1_PG8_ PG8,GPIO_AF1
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15_ 1
#define _TIM2_CH1_PA5_ 1
#define _TIM2_CH1_PD3_ 1
#define _TIM2_CH1_PE15_ 1
#define _TIM2_CH1_PE2_ 1
#define _TIM2_CH1_PF13_ 1
#define _TIM2_CH1_PG8_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF1
#define TIM2_CH2_PB3_ PB3,GPIO_AF1
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF1
#define TIM2_CH3_PB10_ PB10,GPIO_AF1
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PB10_ 1

#define TIM2_CH4_PA3_ PA3,GPIO_AF1
#define TIM2_CH4_PB11_ PB11,GPIO_AF1
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB11_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF1
#define TIM2_ETR_PA15_ PA15,GPIO_AF1
#define TIM2_ETR_PA5_ PA5,GPIO_AF1
#define TIM2_ETR_PD3_ PD3,GPIO_AF2
#define TIM2_ETR_PE15_ PE15,GPIO_AF1
#define TIM2_ETR_PE2_ PE2,GPIO_AF1
#define TIM2_ETR_PF13_ PF13,GPIO_AF1
#define TIM2_ETR_PG8_ PG8,GPIO_AF1
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15_ 1
#define _TIM2_ETR_PA5_ 1
#define _TIM2_ETR_PD3_ 1
#define _TIM2_ETR_PE15_ 1
#define _TIM2_ETR_PE2_ 1
#define _TIM2_ETR_PF13_ 1
#define _TIM2_ETR_PG8_ 1

#define TIM3_CH1_PA6_ PA6,GPIO_AF2
#define TIM3_CH1_PB4_ PB4,GPIO_AF2
#define TIM3_CH1_PC6_ PC6,GPIO_AF2
#define _TIM3_CH1_PA6_ 1
#define _TIM3_CH1_PB4_ 1
#define _TIM3_CH1_PC6_ 1

#define TIM3_CH2_PA7_ PA7,GPIO_AF2
#define TIM3_CH2_PB5_ PB5,GPIO_AF2
#define TIM3_CH2_PC7_ PC7,GPIO_AF2
#define _TIM3_CH2_PA7_ 1
#define _TIM3_CH2_PB5_ 1
#define _TIM3_CH2_PC7_ 1

#define TIM3_CH3_PB0_ PB0,GPIO_AF2
#define TIM3_CH3_PC8_ PC8,GPIO_AF2
#define _TIM3_CH3_PB0_ 1
#define _TIM3_CH3_PC8_ 1

#define TIM3_CH4_PB1_ PB1,GPIO_AF2
#define TIM3_CH4_PC9_ PC9,GPIO_AF2
#define _TIM3_CH4_PB1_ 1
#define _TIM3_CH4_PC9_ 1

#define TIM3_ETR_PC4_ PC4,GPIO_AF2
#define TIM3_ETR_PD2_ PD2,GPIO_AF2
#define _TIM3_ETR_PC4_ 1
#define _TIM3_ETR_PD2_ 1

#define TIM4_CH1_PB6_ PB6,GPIO_AF2
#define TIM4_CH1_PD12_ PD12,GPIO_AF2
#define _TIM4_CH1_PB6_ 1
#define _TIM4_CH1_PD12_ 1

#define TIM4_CH2_PB7_ PB7,GPIO_AF2
#define TIM4_CH2_PD13_ PD13,GPIO_AF2
#define _TIM4_CH2_PB7_ 1
#define _TIM4_CH2_PD13_ 1

#define TIM4_CH3_PB8_ PB8,GPIO_AF2
#define TIM4_CH3_PD14_ PD14,GPIO_AF2
#define TIM4_CH3_PF8_ PF8,GPIO_AF2
#define _TIM4_CH3_PB8_ 1
#define _TIM4_CH3_PD14_ 1
#define _TIM4_CH3_PF8_ 1

#define TIM4_CH4_PB9_ PB9,GPIO_AF2
#define TIM4_CH4_PD15_ PD15,GPIO_AF2
#define _TIM4_CH4_PB9_ 1
#define _TIM4_CH4_PD15_ 1

#define TIM4_ETR_PG1_ PG1,GPIO_AF2
#define _TIM4_ETR_PG1_ 1

#define TIM5_CH1_PA0_ PA0,GPIO_AF2
#define TIM5_CH1_PH10_ PH10,GPIO_AF2
#define _TIM5_CH1_PA0_ 1
#define _TIM5_CH1_PH10_ 1

#define TIM5_CH2_PA1_ PA1,GPIO_AF2
#define TIM5_CH2_PH11_ PH11,GPIO_AF2
#define _TIM5_CH2_PA1_ 1
#define _TIM5_CH2_PH11_ 1

#define TIM5_CH3_PA2_ PA2,GPIO_AF2
#define TIM5_CH3_PH12_ PH12,GPIO_AF2
#define _TIM5_CH3_PA2_ 1
#define _TIM5_CH3_PH12_ 1

#define TIM5_CH4_PA3_ PA3,GPIO_AF2
#define TIM5_CH4_PG6_ PG6,GPIO_AF2
#define _TIM5_CH4_PA3_ 1
#define _TIM5_CH4_PG6_ 1

#define TIM5_ETR_PA4_ PA4,GPIO_AF2
#define TIM5_ETR_PH8_ PH8,GPIO_AF2
#define _TIM5_ETR_PA4_ 1
#define _TIM5_ETR_PH8_ 1

#define TIM8_BKIN_PA6_ PA6,GPIO_AF3
#define TIM8_BKIN_PF10_ PF10,GPIO_AF3
#define TIM8_BKIN_PG2_ PG2,GPIO_AF3
#define _TIM8_BKIN_PA6_ 1
#define _TIM8_BKIN_PF10_ 1
#define _TIM8_BKIN_PG2_ 1

#define TIM8_BKIN2_PA8_ PA8,GPIO_AF3
#define TIM8_BKIN2_PG3_ PG3,GPIO_AF3
#define _TIM8_BKIN2_PA8_ 1
#define _TIM8_BKIN2_PG3_ 1

#define TIM8_CH1_PB6_ PB6,GPIO_AF3
#define TIM8_CH1_PC6_ PC6,GPIO_AF3
#define _TIM8_CH1_PB6_ 1
#define _TIM8_CH1_PC6_ 1

#define TIM8_CH1N_PA5_ PA5,GPIO_AF3
#define TIM8_CH1N_PA7_ PA7,GPIO_AF3
#define TIM8_CH1N_PH13_ PH13,GPIO_AF3
#define _TIM8_CH1N_PA5_ 1
#define _TIM8_CH1N_PA7_ 1
#define _TIM8_CH1N_PH13_ 1

#define TIM8_CH2_PC7_ PC7,GPIO_AF3
#define TIM8_CH2_PD13_ PD13,GPIO_AF3
#define _TIM8_CH2_PC7_ 1
#define _TIM8_CH2_PD13_ 1

#define TIM8_CH2N_PB0_ PB0,GPIO_AF3
#define TIM8_CH2N_PB14_ PB14,GPIO_AF3
#define _TIM8_CH2N_PB0_ 1
#define _TIM8_CH2N_PB14_ 1

#define TIM8_CH3_PC8_ PC8,GPIO_AF3
#define TIM8_CH3_PE5_ PE5,GPIO_AF3
#define TIM8_CH3_PF8_ PF8,GPIO_AF3
#define _TIM8_CH3_PC8_ 1
#define _TIM8_CH3_PE5_ 1
#define _TIM8_CH3_PF8_ 1

#define TIM8_CH3N_PB1_ PB1,GPIO_AF3
#define TIM8_CH3N_PB15_ PB15,GPIO_AF3
#define _TIM8_CH3N_PB1_ 1
#define _TIM8_CH3N_PB15_ 1

#define TIM8_CH4_PC9_ PC9,GPIO_AF3
#define _TIM8_CH4_PC9_ 1

#define TIM8_ETR_PA0_ PA0,GPIO_AF3
#define TIM8_ETR_PG8_ PG8,GPIO_AF3
#define _TIM8_ETR_PA0_ 1
#define _TIM8_ETR_PG8_ 1

#define TSC_G1_IO1_PE4_ PE4,GPIO_AF11
#define _TSC_G1_IO1_PE4_ 1

#define TSC_G1_IO2_PA12_ PA12,GPIO_AF10
#define _TSC_G1_IO2_PA12_ 1

#define TSC_G1_IO3_PD8_ PD8,GPIO_AF10
#define _TSC_G1_IO3_PD8_ 1

#define TSC_G1_IO4_PB6_ PB6,GPIO_AF10
#define _TSC_G1_IO4_PB6_ 1

#define TSC_G2_IO1_PD6_ PD6,GPIO_AF11
#define _TSC_G2_IO1_PD6_ 1

#define TSC_G2_IO2_PD10_ PD10,GPIO_AF10
#define _TSC_G2_IO2_PD10_ 1

#define TSC_G2_IO3_PE1_ PE1,GPIO_AF3
#define _TSC_G2_IO3_PE1_ 1

#define TSC_G2_IO4_PD13_ PD13,GPIO_AF10
#define _TSC_G2_IO4_PD13_ 1

#define TSC_G3_IO1_PA15_ PA15,GPIO_AF10
#define _TSC_G3_IO1_PA15_ 1

#define TSC_G3_IO2_PE12_ PE12,GPIO_AF10
#define _TSC_G3_IO2_PE12_ 1

#define TSC_G3_IO3_PF4_ PF4,GPIO_AF10
#define _TSC_G3_IO3_PF4_ 1

#define TSC_G4_IO1_PE0_ PE0,GPIO_AF10
#define _TSC_G4_IO1_PE0_ 1

#define TSC_G4_IO2_PG0_ PG0,GPIO_AF10
#define _TSC_G4_IO2_PG0_ 1

