susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MP13x.h
#define TSC_G4_IO3_PH2_ PH2,GPIO_AF3
#define _TSC_G4_IO3_PH2_ 1

#define TSC_G5_IO1_PE2_ PE2,GPIO_AF3
#define _TSC_G5_IO1_PE2_ 1

#define TSC_G5_IO2_PG12_ PG12,GPIO_AF3
#define _TSC_G5_IO2_PG12_ 1

#define TSC_SYNC_PB7_ PB7,GPIO_AF3
#define TSC_SYNC_PH9_ PH9,GPIO_AF3
#define _TSC_SYNC_PB7_ 1
#define _TSC_SYNC_PH9_ 1

#define UART1_CK_PA6_ PA6,GPIO_AF7
#define UART1_CK_PA8_ PA8,GPIO_AF7
#define UART1_CK_PB0_ PB0,GPIO_AF7
#define _UART1_CK_PA6_ 1
#define _UART1_CK_PA8_ 1
#define _UART1_CK_PB0_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF7
#define UART1_CTS_PA7_ PA7,GPIO_AF7
#define _UART1_CTS_PA11_ 1
#define _UART1_CTS_PA7_ 1

#define UART1_DE_PA12_ PA12,GPIO_AF7
#define UART1_DE_PC2_ PC2,GPIO_AF7
#define _UART1_DE_PA12_ 1
#define _UART1_DE_PC2_ 1

#define UART1_NSS_PA11_ PA11,GPIO_AF7
#define UART1_NSS_PA7_ PA7,GPIO_AF7
#define _UART1_NSS_PA11_ 1
#define _UART1_NSS_PA7_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF7
#define UART1_RTS_PC2_ PC2,GPIO_AF7
#define _UART1_RTS_PA12_ 1
#define _UART1_RTS_PC2_ 1

#define UART1_RX_PB0_ PB0,GPIO_AF4
#define UART1_RX_PD13_ PD13,GPIO_AF7
#define UART1_RX_PD14_ PD14,GPIO_AF7
#define UART1_RX_PG6_ PG6,GPIO_AF4
#define _UART1_RX_PB0_ 1
#define _UART1_RX_PD13_ 1
#define _UART1_RX_PD14_ 1
#define _UART1_RX_PG6_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF7
#define UART1_TX_PB14_ PB14,GPIO_AF4
#define UART1_TX_PB6_ PB6,GPIO_AF4
#define UART1_TX_PC0_ PC0,GPIO_AF7
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB14_ 1
#define _UART1_TX_PB6_ 1
#define _UART1_TX_PC0_ 1

#define UART2_CK_PA4_ PA4,GPIO_AF3
#define UART2_CK_PA5_ PA5,GPIO_AF2
#define UART2_CK_PD7_ PD7,GPIO_AF3
#define UART2_CK_PH13_ PH13,GPIO_AF2
#define UART2_CK_PH6_ PH6,GPIO_AF3
#define _UART2_CK_PA4_ 1
#define _UART2_CK_PA5_ 1
#define _UART2_CK_PD7_ 1
#define _UART2_CK_PH13_ 1
#define _UART2_CK_PH6_ 1

#define UART2_CTS_PC5_ PC5,GPIO_AF7
#define UART2_CTS_PD3_ PD3,GPIO_AF3
#define UART2_CTS_PE11_ PE11,GPIO_AF2
#define UART2_CTS_PE15_ PE15,GPIO_AF3
#define _UART2_CTS_PC5_ 1
#define _UART2_CTS_PD3_ 1
#define _UART2_CTS_PE11_ 1
#define _UART2_CTS_PE15_ 1

#define UART2_DE_PA1_ PA1,GPIO_AF7
#define UART2_DE_PD4_ PD4,GPIO_AF3
#define _UART2_DE_PA1_ 1
#define _UART2_DE_PD4_ 1

#define UART2_NSS_PC5_ PC5,GPIO_AF7
#define UART2_NSS_PD3_ PD3,GPIO_AF3
#define UART2_NSS_PE11_ PE11,GPIO_AF2
#define UART2_NSS_PE15_ PE15,GPIO_AF3
#define _UART2_NSS_PC5_ 1
#define _UART2_NSS_PD3_ 1
#define _UART2_NSS_PE11_ 1
#define _UART2_NSS_PE15_ 1

#define UART2_RTS_PA1_ PA1,GPIO_AF7
#define UART2_RTS_PD4_ PD4,GPIO_AF3
#define _UART2_RTS_PA1_ 1
#define _UART2_RTS_PD4_ 1

#define UART2_RX_PA3_ PA3,GPIO_AF7
#define UART2_RX_PD15_ PD15,GPIO_AF1
#define UART2_RX_PF4_ PF4,GPIO_AF3
#define UART2_RX_PH8_ PH8,GPIO_AF3
#define _UART2_RX_PA3_ 1
#define _UART2_RX_PD15_ 1
#define _UART2_RX_PF4_ 1
#define _UART2_RX_PH8_ 1

#define UART2_TX_PA2_ PA2,GPIO_AF7
#define UART2_TX_PD8_ PD8,GPIO_AF3
#define UART2_TX_PF11_ PF11,GPIO_AF1
#define UART2_TX_PF13_ PF13,GPIO_AF7
#define UART2_TX_PH12_ PH12,GPIO_AF1
#define _UART2_TX_PA2_ 1
#define _UART2_TX_PD8_ 1
#define _UART2_TX_PF11_ 1
#define _UART2_TX_PF13_ 1
#define _UART2_TX_PH12_ 1

#define UART3_CK_PB4_ PB4,GPIO_AF7
#define UART3_CK_PC11_ PC11,GPIO_AF7
#define UART3_CK_PD10_ PD10,GPIO_AF7
#define UART3_CK_PF0_ PF0,GPIO_AF7
#define _UART3_CK_PB4_ 1
#define _UART3_CK_PC11_ 1
#define _UART3_CK_PD10_ 1
#define _UART3_CK_PF0_ 1

#define UART3_CTS_PC7_ PC7,GPIO_AF8
#define UART3_CTS_PC8_ PC8,GPIO_AF8
#define UART3_CTS_PD11_ PD11,GPIO_AF7
#define UART3_CTS_PG12_ PG12,GPIO_AF8
#define UART3_CTS_PH10_ PH10,GPIO_AF7
#define _UART3_CTS_PC7_ 1
#define _UART3_CTS_PC8_ 1
#define _UART3_CTS_PD11_ 1
#define _UART3_CTS_PG12_ 1
#define _UART3_CTS_PH10_ 1

#define UART3_DE_PD12_ PD12,GPIO_AF7
#define UART3_DE_PE3_ PE3,GPIO_AF8
#define UART3_DE_PG8_ PG8,GPIO_AF8
#define _UART3_DE_PD12_ 1
#define _UART3_DE_PE3_ 1
#define _UART3_DE_PG8_ 1

#define UART3_NSS_PD11_ PD11,GPIO_AF7
#define UART3_NSS_PH10_ PH10,GPIO_AF7
#define _UART3_NSS_PD11_ 1
#define _UART3_NSS_PH10_ 1

#define UART3_RTS_PC9_ PC9,GPIO_AF7
#define UART3_RTS_PD12_ PD12,GPIO_AF7
#define UART3_RTS_PE3_ PE3,GPIO_AF8
#define UART3_RTS_PG8_ PG8,GPIO_AF8
#define _UART3_RTS_PC9_ 1
#define _UART3_RTS_PD12_ 1
#define _UART3_RTS_PE3_ 1
#define _UART3_RTS_PG8_ 1

#define UART3_RX_PB11_ PB11,GPIO_AF7
#define UART3_RX_PB12_ PB12,GPIO_AF8
#define UART3_RX_PD2_ PD2,GPIO_AF7
#define UART3_RX_PG4_ PG4,GPIO_AF8
#define _UART3_RX_PB11_ 1
#define _UART3_RX_PB12_ 1
#define _UART3_RX_PD2_ 1
#define _UART3_RX_PG4_ 1

#define UART3_TX_PB10_ PB10,GPIO_AF7
#define UART3_TX_PC10_ PC10,GPIO_AF7
#define UART3_TX_PD8_ PD8,GPIO_AF7
#define UART3_TX_PG11_ PG11,GPIO_AF7
#define _UART3_TX_PB10_ 1
#define _UART3_TX_PC10_ 1
#define _UART3_TX_PD8_ 1
#define _UART3_TX_PG11_ 1

#define UART4_CTS_PB0_ PB0,GPIO_AF8
#define UART4_CTS_PF7_ PF7,GPIO_AF8
#define _UART4_CTS_PB0_ 1
#define _UART4_CTS_PF7_ 1

#define UART4_DE_PA15_ PA15,GPIO_AF7
#define UART4_DE_PA6_ PA6,GPIO_AF8
#define UART4_DE_PE6_ PE6,GPIO_AF8
#define _UART4_DE_PA15_ 1
#define _UART4_DE_PA6_ 1
#define _UART4_DE_PE6_ 1

#define UART4_RTS_PA15_ PA15,GPIO_AF7
#define UART4_RTS_PA6_ PA6,GPIO_AF8
#define UART4_RTS_PE6_ PE6,GPIO_AF8
#define _UART4_RTS_PA15_ 1
#define _UART4_RTS_PA6_ 1
#define _UART4_RTS_PE6_ 1

#define UART4_RX_PA15_ PA15,GPIO_AF8
#define UART4_RX_PB1_ PB1,GPIO_AF7
#define UART4_RX_PB2_ PB2,GPIO_AF8
#define UART4_RX_PB8_ PB8,GPIO_AF8
#define UART4_RX_PD8_ PD8,GPIO_AF8
#define UART4_RX_PE5_ PE5,GPIO_AF8
#define UART4_RX_PH14_ PH14,GPIO_AF8
#define _UART4_RX_PA15_ 1
#define _UART4_RX_PB1_ 1
#define _UART4_RX_PB2_ 1
#define _UART4_RX_PB8_ 1
#define _UART4_RX_PD8_ 1
#define _UART4_RX_PE5_ 1
#define _UART4_RX_PH14_ 1

#define UART4_TX_PA13_ PA13,GPIO_AF8
#define UART4_TX_PA9_ PA9,GPIO_AF8
#define UART4_TX_PD1_ PD1,GPIO_AF8
#define UART4_TX_PD6_ PD6,GPIO_AF8
#define UART4_TX_PF12_ PF12,GPIO_AF8
#define UART4_TX_PG11_ PG11,GPIO_AF8
#define UART4_TX_PH13_ PH13,GPIO_AF8
#define _UART4_TX_PA13_ 1
#define _UART4_TX_PA9_ 1
#define _UART4_TX_PD1_ 1
#define _UART4_TX_PD6_ 1
#define _UART4_TX_PF12_ 1
#define _UART4_TX_PG11_ 1
#define _UART4_TX_PH13_ 1

#define UART5_CTS_PC3_ PC3,GPIO_AF8
#define UART5_CTS_PC9_ PC9,GPIO_AF8
#define _UART5_CTS_PC3_ 1
#define _UART5_CTS_PC9_ 1

