susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MP13x.h
#define UART5_DE_PC4_ PC4,GPIO_AF8
#define UART5_DE_PC8_ PC8,GPIO_AF11
#define _UART5_DE_PC4_ 1
#define _UART5_DE_PC8_ 1

#define UART5_RTS_PC4_ PC4,GPIO_AF8
#define UART5_RTS_PC8_ PC8,GPIO_AF11
#define _UART5_RTS_PC4_ 1
#define _UART5_RTS_PC8_ 1

#define UART5_RX_PB12_ PB12,GPIO_AF11
#define UART5_RX_PB5_ PB5,GPIO_AF11
#define UART5_RX_PC11_ PC11,GPIO_AF8
#define UART5_RX_PF13_ PF13,GPIO_AF8
#define _UART5_RX_PB12_ 1
#define _UART5_RX_PB5_ 1
#define _UART5_RX_PC11_ 1
#define _UART5_RX_PF13_ 1

#define UART5_TX_PA0_ PA0,GPIO_AF8
#define UART5_TX_PB13_ PB13,GPIO_AF11
#define UART5_TX_PB9_ PB9,GPIO_AF11
#define UART5_TX_PE7_ PE7,GPIO_AF8
#define _UART5_TX_PA0_ 1
#define _UART5_TX_PB13_ 1
#define _UART5_TX_PB9_ 1
#define _UART5_TX_PE7_ 1

#define UART6_CK_PC8_ PC8,GPIO_AF7
#define UART6_CK_PE11_ PE11,GPIO_AF7
#define UART6_CK_PF2_ PF2,GPIO_AF7
#define _UART6_CK_PC8_ 1
#define _UART6_CK_PE11_ 1
#define _UART6_CK_PF2_ 1

#define UART6_CTS_PG13_ PG13,GPIO_AF7
#define UART6_CTS_PG15_ PG15,GPIO_AF7
#define _UART6_CTS_PG13_ 1
#define _UART6_CTS_PG15_ 1

#define UART6_DE_PE2_ PE2,GPIO_AF7
#define UART6_DE_PF10_ PF10,GPIO_AF7
#define UART6_DE_PG12_ PG12,GPIO_AF7
#define _UART6_DE_PE2_ 1
#define _UART6_DE_PF10_ 1
#define _UART6_DE_PG12_ 1

#define UART6_NSS_PG13_ PG13,GPIO_AF7
#define UART6_NSS_PG15_ PG15,GPIO_AF7
#define _UART6_NSS_PG13_ 1
#define _UART6_NSS_PG15_ 1

#define UART6_RTS_PE2_ PE2,GPIO_AF7
#define UART6_RTS_PF10_ PF10,GPIO_AF7
#define UART6_RTS_PG12_ PG12,GPIO_AF7
#define _UART6_RTS_PE2_ 1
#define _UART6_RTS_PF10_ 1
#define _UART6_RTS_PG12_ 1

#define UART6_RX_PC7_ PC7,GPIO_AF7
#define UART6_RX_PG9_ PG9,GPIO_AF7
#define UART6_RX_PH11_ PH11,GPIO_AF7
#define _UART6_RX_PC7_ 1
#define _UART6_RX_PG9_ 1
#define _UART6_RX_PH11_ 1

#define UART6_TX_PC6_ PC6,GPIO_AF7
#define UART6_TX_PF8_ PF8,GPIO_AF7
#define UART6_TX_PG14_ PG14,GPIO_AF7
#define _UART6_TX_PC6_ 1
#define _UART6_TX_PF8_ 1
#define _UART6_TX_PG14_ 1

#define UART7_CTS_PB15_ PB15,GPIO_AF7
#define UART7_CTS_PF9_ PF9,GPIO_AF7
#define UART7_CTS_PG15_ PG15,GPIO_AF8
#define UART7_CTS_PG7_ PG7,GPIO_AF8
#define _UART7_CTS_PB15_ 1
#define _UART7_CTS_PF9_ 1
#define _UART7_CTS_PG15_ 1
#define _UART7_CTS_PG7_ 1

#define UART7_DE_PB12_ PB12,GPIO_AF7
#define UART7_DE_PE4_ PE4,GPIO_AF7
#define UART7_DE_PF10_ PF10,GPIO_AF8
#define _UART7_DE_PB12_ 1
#define _UART7_DE_PE4_ 1
#define _UART7_DE_PF10_ 1

#define UART7_RTS_PB12_ PB12,GPIO_AF7
#define UART7_RTS_PE4_ PE4,GPIO_AF7
#define UART7_RTS_PF10_ PF10,GPIO_AF8
#define _UART7_RTS_PB12_ 1
#define _UART7_RTS_PE4_ 1
#define _UART7_RTS_PF10_ 1

#define UART7_RX_PB3_ PB3,GPIO_AF13
#define UART7_RX_PD11_ PD11,GPIO_AF13
#define UART7_RX_PE10_ PE10,GPIO_AF7
#define UART7_RX_PF6_ PF6,GPIO_AF7
#define _UART7_RX_PB3_ 1
#define _UART7_RX_PD11_ 1
#define _UART7_RX_PE10_ 1
#define _UART7_RX_PF6_ 1

#define UART7_TX_PC12_ PC12,GPIO_AF8
#define UART7_TX_PE8_ PE8,GPIO_AF7
#define UART7_TX_PF7_ PF7,GPIO_AF7
#define UART7_TX_PH2_ PH2,GPIO_AF8
#define _UART7_TX_PC12_ 1
#define _UART7_TX_PE8_ 1
#define _UART7_TX_PF7_ 1
#define _UART7_TX_PH2_ 1

#define UART8_CTS_PD14_ PD14,GPIO_AF8
#define UART8_CTS_PG10_ PG10,GPIO_AF8
#define _UART8_CTS_PD14_ 1
#define _UART8_CTS_PG10_ 1

#define UART8_DE_PE12_ PE12,GPIO_AF8
#define UART8_DE_PE14_ PE14,GPIO_AF8
#define _UART8_DE_PE12_ 1
#define _UART8_DE_PE14_ 1

#define UART8_RTS_PE12_ PE12,GPIO_AF8
#define UART8_RTS_PE14_ PE14,GPIO_AF8
#define _UART8_RTS_PE12_ 1
#define _UART8_RTS_PE14_ 1

#define UART8_RX_PE0_ PE0,GPIO_AF8
#define UART8_RX_PF9_ PF9,GPIO_AF8
#define _UART8_RX_PE0_ 1
#define _UART8_RX_PF9_ 1

#define UART8_TX_PE1_ PE1,GPIO_AF8
#define UART8_TX_PE4_ PE4,GPIO_AF8
#define _UART8_TX_PE1_ 1
#define _UART8_TX_PE4_ 1

#define USART1_CK_PA6_ PA6,GPIO_AF7
#define USART1_CK_PA8_ PA8,GPIO_AF7
#define USART1_CK_PB0_ PB0,GPIO_AF7
#define _USART1_CK_PA6_ 1
#define _USART1_CK_PA8_ 1
#define _USART1_CK_PB0_ 1

#define USART1_CTS_PA11_ PA11,GPIO_AF7
#define USART1_CTS_PA7_ PA7,GPIO_AF7
#define _USART1_CTS_PA11_ 1
#define _USART1_CTS_PA7_ 1

#define USART1_DE_PA12_ PA12,GPIO_AF7
#define USART1_DE_PC2_ PC2,GPIO_AF7
#define _USART1_DE_PA12_ 1
#define _USART1_DE_PC2_ 1

#define USART1_NSS_PA11_ PA11,GPIO_AF7
#define USART1_NSS_PA7_ PA7,GPIO_AF7
#define _USART1_NSS_PA11_ 1
#define _USART1_NSS_PA7_ 1

#define USART1_RTS_PA12_ PA12,GPIO_AF7
#define USART1_RTS_PC2_ PC2,GPIO_AF7
#define _USART1_RTS_PA12_ 1
#define _USART1_RTS_PC2_ 1

#define USART1_RX_PB0_ PB0,GPIO_AF4
#define USART1_RX_PD13_ PD13,GPIO_AF7
#define USART1_RX_PD14_ PD14,GPIO_AF7
#define USART1_RX_PG6_ PG6,GPIO_AF4
#define _USART1_RX_PB0_ 1
#define _USART1_RX_PD13_ 1
#define _USART1_RX_PD14_ 1
#define _USART1_RX_PG6_ 1

#define USART1_TX_PA9_ PA9,GPIO_AF7
#define USART1_TX_PB14_ PB14,GPIO_AF4
#define USART1_TX_PB6_ PB6,GPIO_AF4
#define USART1_TX_PC0_ PC0,GPIO_AF7
#define _USART1_TX_PA9_ 1
#define _USART1_TX_PB14_ 1
#define _USART1_TX_PB6_ 1
#define _USART1_TX_PC0_ 1

#define USART2_CK_PA4_ PA4,GPIO_AF3
#define USART2_CK_PA5_ PA5,GPIO_AF2
#define USART2_CK_PD7_ PD7,GPIO_AF3
#define USART2_CK_PH13_ PH13,GPIO_AF2
#define USART2_CK_PH6_ PH6,GPIO_AF3
#define _USART2_CK_PA4_ 1
#define _USART2_CK_PA5_ 1
#define _USART2_CK_PD7_ 1
#define _USART2_CK_PH13_ 1
#define _USART2_CK_PH6_ 1

#define USART2_CTS_PC5_ PC5,GPIO_AF7
#define USART2_CTS_PD3_ PD3,GPIO_AF3
#define USART2_CTS_PE11_ PE11,GPIO_AF2
#define USART2_CTS_PE15_ PE15,GPIO_AF3
#define _USART2_CTS_PC5_ 1
#define _USART2_CTS_PD3_ 1
#define _USART2_CTS_PE11_ 1
#define _USART2_CTS_PE15_ 1

#define USART2_DE_PA1_ PA1,GPIO_AF7
#define USART2_DE_PD4_ PD4,GPIO_AF3
#define _USART2_DE_PA1_ 1
#define _USART2_DE_PD4_ 1

#define USART2_NSS_PC5_ PC5,GPIO_AF7
#define USART2_NSS_PD3_ PD3,GPIO_AF3
#define USART2_NSS_PE11_ PE11,GPIO_AF2
#define USART2_NSS_PE15_ PE15,GPIO_AF3
#define _USART2_NSS_PC5_ 1
#define _USART2_NSS_PD3_ 1
#define _USART2_NSS_PE11_ 1
#define _USART2_NSS_PE15_ 1

#define USART2_RTS_PA1_ PA1,GPIO_AF7
#define USART2_RTS_PD4_ PD4,GPIO_AF3
#define _USART2_RTS_PA1_ 1
#define _USART2_RTS_PD4_ 1

#define USART2_RX_PA3_ PA3,GPIO_AF7
#define USART2_RX_PD15_ PD15,GPIO_AF1
#define USART2_RX_PF4_ PF4,GPIO_AF3
#define USART2_RX_PH8_ PH8,GPIO_AF3
#define _USART2_RX_PA3_ 1
#define _USART2_RX_PD15_ 1
#define _USART2_RX_PF4_ 1
#define _USART2_RX_PH8_ 1

#define USART2_TX_PA2_ PA2,GPIO_AF7
#define USART2_TX_PD8_ PD8,GPIO_AF3
#define USART2_TX_PF11_ PF11,GPIO_AF1
#define USART2_TX_PF13_ PF13,GPIO_AF7
#define USART2_TX_PH12_ PH12,GPIO_AF1
#define _USART2_TX_PA2_ 1
#define _USART2_TX_PD8_ 1
#define _USART2_TX_PF11_ 1
#define _USART2_TX_PF13_ 1
#define _USART2_TX_PH12_ 1

#define USART3_CK_PB4_ PB4,GPIO_AF7
#define USART3_CK_PC11_ PC11,GPIO_AF7
#define USART3_CK_PD10_ PD10,GPIO_AF7
#define USART3_CK_PF0_ PF0,GPIO_AF7
#define _USART3_CK_PB4_ 1
#define _USART3_CK_PC11_ 1
#define _USART3_CK_PD10_ 1
#define _USART3_CK_PF0_ 1

#define USART3_CTS_PC7_ PC7,GPIO_AF8
#define USART3_CTS_PC8_ PC8,GPIO_AF8
#define USART3_CTS_PD11_ PD11,GPIO_AF7
#define USART3_CTS_PG12_ PG12,GPIO_AF8
#define USART3_CTS_PH10_ PH10,GPIO_AF7
#define _USART3_CTS_PC7_ 1
#define _USART3_CTS_PC8_ 1
#define _USART3_CTS_PD11_ 1
#define _USART3_CTS_PG12_ 1
#define _USART3_CTS_PH10_ 1

#define USART3_DE_PD12_ PD12,GPIO_AF7
#define USART3_DE_PE3_ PE3,GPIO_AF8
#define USART3_DE_PG8_ PG8,GPIO_AF8
#define _USART3_DE_PD12_ 1
#define _USART3_DE_PE3_ 1
#define _USART3_DE_PG8_ 1

#define USART3_NSS_PD11_ PD11,GPIO_AF7
#define USART3_NSS_PH10_ PH10,GPIO_AF7
#define _USART3_NSS_PD11_ 1
#define _USART3_NSS_PH10_ 1

#define USART3_RTS_PC9_ PC9,GPIO_AF7
#define USART3_RTS_PD12_ PD12,GPIO_AF7
#define USART3_RTS_PE3_ PE3,GPIO_AF8
#define USART3_RTS_PG8_ PG8,GPIO_AF8
#define _USART3_RTS_PC9_ 1
#define _USART3_RTS_PD12_ 1
#define _USART3_RTS_PE3_ 1
#define _USART3_RTS_PG8_ 1

