susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32MP13x.h
#define USART3_RX_PB11_ PB11,GPIO_AF7
#define USART3_RX_PB12_ PB12,GPIO_AF8
#define USART3_RX_PD2_ PD2,GPIO_AF7
#define USART3_RX_PG4_ PG4,GPIO_AF8
#define _USART3_RX_PB11_ 1
#define _USART3_RX_PB12_ 1
#define _USART3_RX_PD2_ 1
#define _USART3_RX_PG4_ 1

#define USART3_TX_PB10_ PB10,GPIO_AF7
#define USART3_TX_PC10_ PC10,GPIO_AF7
#define USART3_TX_PD8_ PD8,GPIO_AF7
#define USART3_TX_PG11_ PG11,GPIO_AF7
#define _USART3_TX_PB10_ 1
#define _USART3_TX_PC10_ 1
#define _USART3_TX_PD8_ 1
#define _USART3_TX_PG11_ 1

#define USART6_CK_PC8_ PC8,GPIO_AF7
#define USART6_CK_PE11_ PE11,GPIO_AF7
#define USART6_CK_PF2_ PF2,GPIO_AF7
#define _USART6_CK_PC8_ 1
#define _USART6_CK_PE11_ 1
#define _USART6_CK_PF2_ 1

#define USART6_CTS_PG13_ PG13,GPIO_AF7
#define USART6_CTS_PG15_ PG15,GPIO_AF7
#define _USART6_CTS_PG13_ 1
#define _USART6_CTS_PG15_ 1

#define USART6_DE_PE2_ PE2,GPIO_AF7
#define USART6_DE_PF10_ PF10,GPIO_AF7
#define USART6_DE_PG12_ PG12,GPIO_AF7
#define _USART6_DE_PE2_ 1
#define _USART6_DE_PF10_ 1
#define _USART6_DE_PG12_ 1

#define USART6_NSS_PG13_ PG13,GPIO_AF7
#define USART6_NSS_PG15_ PG15,GPIO_AF7
#define _USART6_NSS_PG13_ 1
#define _USART6_NSS_PG15_ 1

#define USART6_RTS_PE2_ PE2,GPIO_AF7
#define USART6_RTS_PF10_ PF10,GPIO_AF7
#define USART6_RTS_PG12_ PG12,GPIO_AF7
#define _USART6_RTS_PE2_ 1
#define _USART6_RTS_PF10_ 1
#define _USART6_RTS_PG12_ 1

#define USART6_RX_PC7_ PC7,GPIO_AF7
#define USART6_RX_PG9_ PG9,GPIO_AF7
#define USART6_RX_PH11_ PH11,GPIO_AF7
#define _USART6_RX_PC7_ 1
#define _USART6_RX_PG9_ 1
#define _USART6_RX_PH11_ 1

#define USART6_TX_PC6_ PC6,GPIO_AF7
#define USART6_TX_PF8_ PF8,GPIO_AF7
#define USART6_TX_PG14_ PG14,GPIO_AF7
#define _USART6_TX_PC6_ 1
#define _USART6_TX_PF8_ 1
#define _USART6_TX_PG14_ 1

#define USB_OTG_HS_SOF_PA14_ PA14,GPIO_AF10
#define USB_OTG_HS_SOF_PA8_ PA8,GPIO_AF10
#define _USB_OTG_HS_SOF_PA14_ 1
#define _USB_OTG_HS_SOF_PA8_ 1

#endif /* LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION */